import {
  Component,
  OnInit,
  ViewChild,
  ElementRef,
  AfterViewInit
} from "@angular/core";
import { ActivatedRoute } from "@angular/router";
import * as $ from "jquery";

@Component({
  selector: "app-food",
  templateUrl: "./food.component.html",
  styleUrls: ["./food.component.scss"]
})
export class FoodComponent implements OnInit {
  foods: any = [
    [
      "rice",
      {
        imgName: "../../../assets/img/vegetarian/rice.jpg",
        title: "الأرز",
        valueImg: "../../../assets/img/food/rice.jpg",
        information: {
          when: {
            key: "when",
            title: "متى بدأت زراعة الأرز",
            answer:
              "أظهرت دراسة صينية أن الأرز زُرع بالفعل قبل 9400 سنة على الأقل في الصين. وقال الباحثون إنهم توصلوا لهذه النتيجة بعد معرفة تاريخ بقايا أرز عثروا عليها بالقرب من مصب نهر اليانغتسي بالقرب من مدينة شنغهاي باستخدام الكربون المشع",
            question: {
              title: "متي تمت  زراعة الأرز",
              options: ["قبل 9300 سنة", "قبل 5000 سنة", "قبل 9400 سنة"],
              answer: "قبل 9400 سنة"
            }
          },
          where: {
            key: "where",
            title: "أين بدأت  زراعة الأرز",
            answer:
              "لا يعرف موطن الأرز الأصلي على وجه التحديد ولكن يرجح أن يكون من شرق آسيا فقد بدأت زراعته في وادي نهر يانغتسي في الصين منذ 2000 عام قبل الميلاد.",
            question: {
              title: "أين تمت  زراعة الأرز",
              options: ["جنوب افريقيا", "شرق أوروبا", "شرق آسيا"],
              answer: "شرق آسيا"
            }
          },
          benefits: {
            key: "benefits",
            title: "فوائده",
            answer: [
              "مصدر للطاقة",
              "تنظيم ضغط الدم",
              "دعم صحة الجهاز الهضمي",
              "مصدر عالي للكربوهيدرات خالي من الجلوتين"
            ],
            question: {
              title: "من فوائد الأرز",
              options: [
                "تنظيم ضغط الدم",
                "مصدر عالي للكربوهيدرات",
                "جميع ما سبق"
              ],
              answer: "جميع ما سبق"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "تتمثل أضرار الأرز في الطريقة المتبعة في تحضيره والكميات المتناولة منه لكنه في الاصل امن تماما صحيا ولا يسبب الحساسية",
            question: {
              title: "من أعراض حساسية الأرز",
              options: ["تضغط أصابع اليد", "تورم القدمين", "لا شيء مما سبق"],
              answer: "لا شيء مما سبق"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "الاصل في الامور الحل ما لم يأتي نص شرعي بتحريمها او لم تقاس على غيرها."
          }
        }
      }
    ],
    [
      "wheat",
      {
        imgName: "../../../assets/img/vegetarian/wheat.jpg",
        title: "القمح",
        valueImg: "../../../assets/img/food/wheat.jpg",
        information: {
          when: {
            key: "when",
            title: "متى بدأت زراعته",
            answer:
              "وجدت اقدم اثار لقمح الخبز المستانس في العالم في وادي قلات جنوب الاردن وقد ارخت تاريخ الحبوب المتكشفة بين 9000 الى 9200 سنة بواسطة الكربون المشجع",
            question: {
              title: "متي بدأت زراعة القمح",
              options: ["قبل 9200 سنة", "قبل 8000 سنة", "قبل 6000 سنة"],
              answer: "قبل 9200 سنة"
            }
          },
          where: {
            key: "where",
            title: "أين بدأت زراعته",
            answer:
              "زرع القمح للمرة الأولي وادي قلات جنوب الاردن، ويزرع في أكثر بلاد العالم مرة واحدة في السنة وفي بعض البلدان يزرع مرتين. والقمح له أنواع متعددة جداً، فمنها ما يصلح لعمل الخبز ومنه ما يصلح لعمل المعجنات أو المعكرونة",
            question: {
              title: "أين بدأت رزاعة القمح",
              options: ["السعودية", "اليمن", "الأردن"],
              answer: "الأردن"
            }
          },
          benefits: {
            key: "benefits",
            title: "فوائده",
            answer: [
              "يُنشط الدماغ ويُقوّي الذاكرة",
              "يساعد مرضى الكبد على التحسن",
              "يُقوي مناعة الجسم",
              " يُخفف من خطر الإصابة بأمراض القلب"
            ],
            question: {
              title: "من فوائد القمح",
              options: ["يقوي المناعة", "يقوي الذاكرة", "جميع ما سبق"],
              answer: "جميع ما سبق"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "يمكن لتناول خبز القمح أنّ يؤدي إلى حدوث بعض الأضرار منها، زيادة الوزن، وحدوث حساسية عند بعض الأشخاص، وزيادة مخاطر الاصابة بسرطان المستقيم والقولون، وأيضا فقر الدم.",
            question: {
              title: "من أعراض تناول خبر القمح",
              options: ["زيادة الوزن", "تقلصات في المعدة", "الإمساك"],
              answer: "زيادة الوزن"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "الاصل في الامور الحل ما لم يأتي نص شرعي بتحريمها او لم تقاس على غيرها."
          }
        }
      }
    ],
    [
      "corn",
      {
        imgName: "../../../assets/img/vegetarian/corn.jpg",
        title: "الذرة",
        valueImg: "../../../assets/img/food/corn.jpg",
        information: {
          when: {
            key: "when",
            title: "متى بدأت زراعته",
            answer:
              "عندما غزا الاسبان الامريكتين في القرن السادس عشر وجدوا حضارة متقدمة من السكان الاصليين وكانوا مشهورين زراعة الذرة والبطاطس، ولم يعرف تاريخ زراعته بالتحديد",
            question: {
              title: "متي بدأت زراعة الذرة",
              options: ["القرن العاشر", "القرن السادس عشر", "غير معلوم"],
              answer: "غير معلوم"
            }
          },
          where: {
            key: "where",
            title: "أين بدأت زراعته",
            answer:
              "موطنها الأصلي هو جنوب المكسيك وغواتيمالا، واستعملها الهنود الحمر مصدرًا للدقيق، ثم نشرها المستعمرون الأوروبيون في أنحاء العالم القديم، كما تعد الذرة أهم محصول في الولايات المتحدة، ومن أهم الدول المنتجة له إضافة إلى الولايات المتحدة: الصين، والبرازيل، والمكسيك والأرجنتين، والهند، وفرنسا، وإندونيسيا",
            question: {
              title: "أين بدأت رزاعة ",
              options: ["أمريكا", "انجلترا", "المكسيك"],
              answer: "المكسيك"
            }
          },
          benefits: {
            key: "benefits",
            title: "فوائده",
            answer: [
              "تساهم في خفض الكولسترول",
              "تنظم ضغط الدم",
              "تحسن عمل الجهاز الهضمي",
              "تحافظ على توازن السوائل في الجسم "
            ],
            question: {
              title: "من أهم فوائد الذرة",
              options: ["خفض الكوليسترول", "تقوية المناعة", "مصدر للطاقة"],
              answer: "خفض الكوليسترول"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "يعتبر تناول الذرة آمنًا بشكل عام، لكن قد يكون لتناولها بعض الآثار الجانبية خصوصًا عند الأشخاص الذين يعتبرونها مصدرًا أساسيًا للكربوهيدرات، فقد يتعارض حمض الفايتك الموجود فيها مع امتصاص بعض المعادن كالحديد والزنك",
            question: {
              title: "من أعراض حساسية الذرة",
              options: ["زيادة الوزن", "تورم الكتفين", "لا يوجد"],
              answer: "لا يوجد"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "الاصل في الامور الحل ما لم يأتي نص شرعي بتحريمها او لم تقاس على غيرها."
          }
        }
      }
    ],
    [
      "barley",
      {
        imgName: "../../../assets/img/vegetarian/barley.jpg",
        title: "الشعير",
        valueImg: "../../../assets/img/food/barley.jpg",
        information: {
          when: {
            key: "when",
            title: "متى بدأت زراعته",
            answer:
              "يعتبر الشعير أقدم مادة استعملها الإنسان في غذائه. وقد كان من المحاصيل الغذائية الرئيسية في العصور القديمة حيث كان يصنع منه الخبز.",
            question: {
              title: "متي بدأت زراعة ",
              options: [
                "في العصور القديمة",
                "في عصر أوروبا الوسطي",
                "في العهد الإسلامي"
              ],
              answer: "في العصور القديمة"
            }
          },
          where: {
            key: "where",
            title: "أين بدأت زراعته",
            answer:
              "إستعمله سكان الشرق الأوسط منذ القدم غذاء و ذواء عالجوا به إصابات القلب و الشرايين , كما شكل الشعير الغذاء الرئيسي لجيش الرومان الذي إحتل مناطق واسعة من العالم القديم",
            question: {
              title: "أين بدأت رزاعة ",
              options: ["تونس", "اليونان", "جميع ما سبق"],
              answer: "جميع ما سبق"
            }
          },
          benefits: {
            key: "benefits",
            title: "فوائده",
            answer: [
              "تعزيز مناعة الجسم",
              "مقاومة أمراض الشيخوخة",
              "انقاص الوزن",
              "الوقاية من الإصابة بمرض السرطان"
            ],
            question: {
              title: "من فوائد الشعير",
              options: ["تقوية مناعة الجسم", "انقاص الوزن", "جميع ما سبق"],
              answer: "جميع ما سبق"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "إنّ الشعير مصدر غنيّ بالألياف، والكربوهيدرات، والبروتينات، والسكر، والأحماض الدهنيّة، والعضويّة، والأمينيّة، والكثير من المعادن، والفيتامينات، ولذلك لم تثبت الدراسات حتّى الآن أنّ للشعير أيّة أضرار",
            question: {
              title: "من أضرار الشعير",
              options: ["انخفاض ضغط الدم", "لا يوجد", "زيادة الكوليسترول"],
              answer: "لا يوجد"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "الاصل في الامور الحل ما لم يأتي نص شرعي بتحريمها او لم تقاس على غيرها."
          }
        }
      }
    ],
    [
      "beans",
      {
        imgName: "../../../assets/img/vegetarian/beans.jpg",
        title: "الفول",
        section: "مستورات البذور",
        sect: "ثنائيات الفلقة"
      }
    ],
    [
      "lentils",
      {
        imgName: "../../../assets/img/vegetarian/lentils.jpg",
        title: "العدس",
        section: "حقيقيات الأوراق",
        sect: "الوردانية"
      }
    ],
    [
      "chickpeas",
      {
        imgName: "../../../assets/img/vegetarian/chickpeas.jpg",
        title: "الحمص",
        section: "نباتات وعائية",
        sect: "ثنائيات الفلقة"
      }
    ],
    [
      "peas",
      {
        imgName: "../../../assets/img/vegetarian/peas.jpg",
        title: "البازلاء",
        section: "حقيقيات الأوراق",
        sect: "	ثنائيات الفلقة"
      }
    ],
    [
      "lettuce",
      {
        imgName: "../../../assets/img/vegetarian/lettuce.jpg",
        title: "الخس",
        valueImg: "../../../assets/img/food/lettuce.jpg",
        information: {
          when: {
            key: "when",
            title: "متى بدأت زراعته",
            answer:
              "كان المصرييون القدماء اول من زرع الخس فحولوه من حشيشه تستخدم للتسميد الى نبتة تؤكل اوراقها .. انتشر في بلاد الاغريق ثم الرومان عبر التجارة مع مصر وكان الرومان هم من اطلقوا عليه اسم الخس ثم انتشر في جميع انحاء اوروبا واسيا وافريقيا.",
            question: {
              title: "متي بدأت زراعة الخس",
              options: [
                "منذ عهد الدولة البابلية",
                "منذ 3000 عام",
                "منذ عهد المصريين القدماء"
              ],
              answer: "منذ عهد المصريين القدماء"
            }
          },
          where: {
            key: "where",
            title: "أين بدأت زراعته",
            answer:
              "شهدت الفترة الممتدة من القرن السادس عشر حتى القرن الثامن عشر ظهور عدَّة ضروب من الخس في أوروبا، وبحلول أواسط القرن الثامن عشر ظهرت الضروب الشائعة حتى الوقت الحالي. سيطرت أوروبا والولايات المتحدة على تجارة الخس العالميَّة في نهاية المطاف، وبحلول نهاية العقد الأول من القرن العشرين كان استهلاك الخس قد أصبح عالميًّا.",
            question: {
              title: "أين بدأت رزاعة الخس",
              options: ["أمريكا", "مصر القديمة", "أوروبا"],
              answer: "مصر القديمة"
            }
          },
          benefits: {
            key: "benefits",
            title: "فوائده",
            answer: [
              "المساعدة في خسارة الوزن",
              " تعزيز صحة القلب وخفض الكولسترول",
              "تعزيز صحة الجهاز الهضمي",
              "تعزيز المناعة"
            ],
            question: {
              title: "من فوائد الخس",
              options: ["تعزيز المناعة", "خسارة الوزن ", "جميع ما سبق"],
              answer: "جميع ما سبق"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "تناول الخس كثيراً يمكن أن يسبب تلون الوجه بسبب احتوائه على البيتا كاروتين، ولكن هذا اللون يذهب في حالة خفض الكمية التي تتناولها يومياً من البيتا كاروتين. والخس عامة لا يعرف له أي آثار جانبية باستثناء تلون البشرة",
            question: {
              title: "من أعراض حساسية الخس",
              options: ["جفاف العينين", "احمرار اليدين", "تلون الوجه"],
              answer: "تلون الوجه"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "الاصل في الامور الحل ما لم يأتي نص شرعي بتحريمها او لم تقاس على غيرها."
          }
        }
      }
    ],
    [
      "parsley",
      {
        imgName: "../../../assets/img/vegetarian/parsley.jpg",
        title: "البقدونس",
        section: "البذريات",
        sect: "ثنائيات الفلقة",
        valueImg: "../../../assets/img/food/parsley.jpg",
        information: {
          when: {
            key: "when",
            title: "متى بدأت زراعته",
            answer:
              "ترجع زراعة البقدونس الى الحضارات القديمة فقيل ان اول من استخدمه هم المصرييون القدامى وقيل في اوروبا الوسطى في 2000 ق.م",
            question: {
              title: "متي بدأت زراعة البقدونس",
              options: [
                "ألف عام قبل الميلاد",
                "ألفى عام قبل الميلاد",
                "ألف وخمسمائة عام قبل الميلاد"
              ],
              answer: "ألفى عام قبل الميلاد"
            }
          },
          where: {
            key: "where",
            title: "أين بدأت زراعته",
            answer:
              "ترعرع في كل بلاد العالم حيث لا تكاد تخلو منه مطابخ اوروبا واسيا وافريقيا .. كان له شعبية واسعة منذ ايام الاغريق وروما وقبل ذلك في بلاد المصريين القدامى والفينيقيين وباقي الشرق.",
            question: {
              title: "أين بدأت رزاعة البقدونس",
              options: ["آسيا", "أوروبا", "جميع ما سبق"],
              answer: "جميع ما سبق"
            }
          },
          benefits: {
            key: "benefits",
            title: "فوائده",
            answer: [
              "لعلاج التهابات المسالك البوليّة",
              "علاج حصى الكلى والمثانة",
              "يساعد في التّخلص من البكتيريا والحصوات",
              "يرفع من مستوى الجسم في مقاومة الأكسدة"
            ],
            question: {
              title: "من فوائد البقدونس",
              options: [
                "علاج إلتهابات المسالك البولية",
                "علاج حصي الكلي",
                "جميع ما سبق"
              ],
              answer: "جميع ما سبق"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "يعدّ البقدونس آمناً بالنسبة لمعظم البالغين عندما يؤخذ عن طريق الفم كدواء على المدى القصير بالكميات المعتادة، إلا أنّ وضع زيت بذور البقدونس على الجلد يمكن أن يسبب حساسية تجاه أشعة الشمس كما يؤدي إلى طفح جلدي، ومن الخطأ استهلاك كميات كبيرة جداً من البقدونس، لأنّ هذا يمكن أن يسبب آثار جانبية أخرى مثل فقر الدم ومشاكل في الكبد أو الكلى",
            question: {
              title: "من أعراض حساسية البقدونس ",
              options: ["فقر الدم", "مشاكل في القلب", "آلام بالعظام"],
              answer: "فقر الدم"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "الاصل في الامور الحل ما لم يأتي نص شرعي بتحريمها او لم تقاس على غيرها."
          }
        }
      }
    ],
    [
      "tomato",
      {
        imgName: "../../../assets/img/vegetarian/tomato.jpg",
        valueImg: "../../../assets/img/food/tomato.jpg",
        title: "الطماطم",
        section: "مغطات البذور",
        sect: "ثنائيات الفلقة",
        information: {
          when: {
            key: "when",
            title: "متى بدأت زراعتها",
            answer:
              "لم تكن نبتة الطماطم أو البندورة معروفة في بلاد الشام ومنطقة الشرق الأوسط فقد دخلت الطماطم إليها عن طريق قنصل بريطانيا في حلب جون باركر أوائل القرن التاسع عشر، ثم انتشرت زراعتها في تركيا وبلاد الشام ومصر والحجاز وقيل عنه عام 1881 أنه يؤكل ويطبخ في الشرق الأوسط منذ حوالي 40 سنة فقط",
            question: {
              title: "متي بدأت  زراعة الطماطم في الدول العربية",
              options: ["منذ 23 سنة", "منذ 43 سنة", "منذ 40 سنة"],
              answer: "منذ 40 سنة"
            }
          },
          where: {
            key: "where",
            title: "أين بدأت  زراعتها",
            answer:
              "نشأت البندورة في أمريكا الجنوبية، وانتشرت في جميع أنحاء العالم، وذلك بعد الاستعمار الإسباني للأمريكتين، وتزرع البندورة الآن على نطاق واسع، وغالبا ما تزرع في البيوت الزجاجية للحفاظ على درجة الحرارة",
            question: {
              title: "أين بدأت  زراعة الطماطم",
              options: ["شمال افريقيا", "شرق أوروبا", "أمريكا الجنوبية"],
              answer: "أمريكا الجنوبية"
            }
          },
          benefits: {
            key: "benefits",
            title: "فوائدها",
            answer: [
              "الحفاظ على صحة العين، وصحة المعدة",
              "تساهم في انخفاض ضغط الدم",
              "تساعد في الوقاية من مرض السكري",
              "المساعدة في تخفيف مشاكل الجلد، والتهابات المسالك البولية أيضًا"
            ],
            question: {
              title: "من فوائد الطماطم",
              options: [
                "انخفاض ضغط الدم",
                "الوقاية من مرض السكري",
                "جميع ما سبق"
              ],
              answer: "جميع ما سبق"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "قد تهيّج الطّماطم حساسيّة الجلد المعروفة بالأكزيما، وتزيد أعراضَها سوءاً، ومنها الحكّة الشّديدة التي تصيب مرضى الأكزيما، وتهيّج الجلد، وتورّمه، واحمراره. يُنصَح بالابتعاد عن استهلاك الطّماطم لدى الأشخاص الذين يعانون حساسيّة اللاتكس أو المطّاط؛ لأنّها قد تهيّج الجلد، وتزيد حالته سوءاً.",
            question: {
              title: "من أعراض حساسية الجسم للطماطم لمرضي الأكزيما",
              options: ["الحكة الشديده", "تهيج الجلد", "جميع ما سبق"],
              answer: "جميع ما سبق"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "الاصل في الامور الحل ما لم يأتي نص شرعي بتحريمها او لم تقاس على غيرها."
          }
        }
      }
    ],
    [
      "cucumber",
      {
        imgName: "../../../assets/img/vegetarian/cucumber.jpg",
        title: "الخيار",
        section: "مغطاة البذور",
        sect: "ثنائيات الفلقة",
        valueImg: "../../../assets/img/food/cucumber.jpg",
        information: {
          when: {
            key: "when",
            title: "متى بدأت زراعته",
            answer:
              "أصل الخيار من الهند وغرب القارة الآسيوية.وتشير الحفريات الأخيرة إلى أن سكان هذه المناطق يزرعون ويستخدمون الخيار ويطورون أنواعه المختلفة منذ 3000 عام. وأن الرومان هم الذين نقلوه من الهند إلى أوروبا. وكان الخيار من الثمار التي يأكلها أهل العراق القديم والبابلي في مدينة أور",
            question: {
              title: "متي بدأت زراعة الخيار",
              options: ["منذ 5000 عام", "منذ 3000 عام", "منذ 2500 عام"],
              answer: "منذ 3000 عام"
            }
          },
          where: {
            key: "where",
            title: "أين بدأت زراعته",
            answer:
              "يقول البعض ان الخيار انتشر في بلدان شرق اوروبا بلغاريا وكرواتيا ثم وصل لليونان ومن اليونان تلقفه اهل روما والرومان ثم انتقل للصين وحاليا يزرع في معظم دول العالم ويستخدم على نطاق واسع.",
            question: {
              title: " أين بدأت رزاعة الخيار",
              options: ["روما", "كرواتيا", "الصين"],
              answer: "كرواتيا"
            }
          },
          benefits: {
            key: "benefits",
            title: "فوائده",
            answer: [
              "ترطيب الجسم، وحمايته من الجفاف",
              "تقليل درجة حرارة الجسم",
              "حماية البشرة من الالتهابات، وحروق الشمس",
              "علاج الهالات السوداء، وانتفاخ العينين"
            ],
            question: {
              title: "من فوائد الخيار",
              options: [
                "علاج الهالات السوداء",
                "حماية الجسم من الجفاف",
                "جميع ما سبق"
              ],
              answer: "جميع ما سبق"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "قد يؤدي الإفراط في تناوله إلى الآتي: ارتفاع ضغط الدم في حال تناوله على شكل المخلل. ظهور طفح جلدي في حال امتلاك أي نوع من أنواع الحساسية اتجاه الخيار، بالإضافة للحكة، واحمرار الجلد حيناً. تورّم الأطراف السفلية والعلوية، أو العينين في حال الحساسية لبعض الأفراد. انتفاخ البطن، نتيجة تراكم الغازات. اضطربات في عملية الهضم",
            question: {
              title: "من أعراض حساسية الخيار",
              options: ["احمرار الجلد", "الحكة الشديدة", "تهيج الجلد"],
              answer: "احمرار الجلد"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "الاصل في الامور الحل ما لم يأتي نص شرعي بتحريمها او لم تقاس على غيرها."
          }
        }
      }
    ],
    [
      "apple",
      {
        imgName: "../../../assets/img/vegetarian/apple.jpg",
        title: "التفاح",
        section: "شعبة البذريات",
        sect: "الوردانيات"
      }
    ],
    [
      "orange",
      {
        imgName: "../../../assets/img/vegetarian/orange.jpg",
        title: "البرتقال",
        section: "مغطاة البذور",
        sect: "ثنائيات الفلقة"
      }
    ],
    [
      "banana",
      {
        imgName: "../../../assets/img/vegetarian/banana.jpg",
        title: "الموز",
        section: "حقيقيات الأوراق",
        sect: "الزنبقانية"
      }
    ],
    [
      "pomegranate",
      {
        imgName: "../../../assets/img/vegetarian/pomegranate.jpg",
        title: "الرمان",
        section: "مستورات البذور",
        sect: "ثنائيات الفلقة"
      }
    ]
  ];

  myFoods = new Map(this.foods);
  questionBgImg: string = "../../../assets/img/food/question.jpg";
  myFood: any = {};
  id: string;
  selectedValue: string = "";

  @ViewChild("whenDiv", { static: true }) whenDiv: ElementRef;
  @ViewChild("whereDiv", { static: true }) whereDiv: ElementRef;
  @ViewChild("benefitDiv", { static: true }) benefitDiv: ElementRef;
  @ViewChild("senseDiv", { static: true }) SenseDiv: ElementRef;

  correctAnswer = `<div class="alert alert-success wow pulse text-center font-weight-bold" data-wow-duration="1.5s">إجابة صحيحة</div>`;
  incorrectAnswer = `<div class="alert alert-danger wow shake text-center font-weight-bold">إجابة خاطئة</div>`;

  constructor(private route: ActivatedRoute) {
    this.id = this.route.snapshot.params.id;
  }

  ngOnInit() {
    this.myFoods.forEach((value, key) => {
      if (key == this.id) {
        this.myFood = value;
        //console.log(this.myFood);
      }
    });
  }

  getSelectedValue(value: string) {
    this.selectedValue = value;
  }

  check(answer: string, key: string) {
    if (key == "when") {
      if (this.selectedValue == answer) {
        $(this.whenDiv.nativeElement).html(this.correctAnswer);
      } else {
        $(this.whenDiv.nativeElement).html(this.incorrectAnswer);
      }
    } else if (key == "where") {
      if (this.selectedValue == answer) {
        $(this.whereDiv.nativeElement).html(this.correctAnswer);
      } else {
        $(this.whereDiv.nativeElement).html(this.incorrectAnswer);
      }
    } else if (key == "benefits") {
      if (this.selectedValue == answer) {
        $(this.benefitDiv.nativeElement).html(this.correctAnswer);
      } else {
        $(this.benefitDiv.nativeElement).html(this.incorrectAnswer);
      }
    } else if (key == "sensitivity") {
      if (this.selectedValue == answer) {
        $(this.SenseDiv.nativeElement).html(this.correctAnswer);
      } else {
        $(this.SenseDiv.nativeElement).html(this.incorrectAnswer);
      }
    }
  }
}
