import {
  Component,
  OnInit,
  ViewChild,
  ElementRef,
  AfterViewInit
} from "@angular/core";
import { ActivatedRoute } from "@angular/router";
import * as $ from "jquery";

@Component({
  selector: "app-food",
  templateUrl: "./food.component.html",
  styleUrls: ["./food.component.scss"]
})
export class FoodComponent implements OnInit {
  foods: any = [
    [
      "rice",
      {
        imgName: "../../../assets/img/vegetarian/rice.jpg",
        title: "الأرز",
        valueImg: "../../../assets/img/food/rice.jpg",
        information: {
          when: {
            key: "when",
            title: "متى بدأت زراعة الأرز",
            answer:
              "أظهرت دراسة صينية أن الأرز زُرع بالفعل قبل 9400 سنة على الأقل في الصين. وقال الباحثون إنهم توصلوا لهذه النتيجة بعد معرفة تاريخ بقايا أرز عثروا عليها بالقرب من مصب نهر اليانغتسي بالقرب من مدينة شنغهاي باستخدام الكربون المشع",
            question: {
              title: "متي تمت  زراعة الأرز",
              options: ["قبل 9300 سنة", "قبل 5000 سنة", "قبل 9400 سنة"],
              answer: "قبل 9400 سنة"
            }
          },
          where: {
            key: "where",
            title: "أين بدأت  زراعة الأرز",
            answer:
              "لا يعرف موطن الأرز الأصلي على وجه التحديد ولكن يرجح أن يكون من شرق آسيا فقد بدأت زراعته في وادي نهر يانغتسي في الصين منذ 2000 عام قبل الميلاد.",
            question: {
              title: "أين تمت  زراعة الأرز",
              options: ["جنوب افريقيا", "شرق أوروبا", "شرق آسيا"],
              answer: "شرق آسيا"
            }
          },
          benefits: {
            key: "benefits",
            title: "فوائده",
            answer: [
              "مصدر للطاقة",
              "تنظيم ضغط الدم",
              "دعم صحة الجهاز الهضمي",
              "مصدر عالي للكربوهيدرات خالي من الجلوتين"
            ],
            question: {
              title: "من فوائد الأرز",
              options: [
                "تنظيم ضغط الدم",
                "مصدر عالي للكربوهيدرات",
                "جميع ما سبق"
              ],
              answer: "جميع ما سبق"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "تتمثل أضرار الأرز في الطريقة المتبعة في تحضيره والكميات المتناولة منه لكنه في الاصل امن تماما صحيا ولا يسبب الحساسية",
            question: {
              title: "من أعراض حساسية الأرز",
              options: ["تضغط أصابع اليد", "تورم القدمين", "لا شيء مما سبق"],
              answer: "لا شيء مما سبق"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "الاصل في الامور الحل ما لم يأتي نص شرعي بتحريمها او لم تقاس على غيرها."
          }
        }
      }
    ],
    [
      "wheat",
      {
        imgName: "../../../assets/img/vegetarian/wheat.jpg",
        title: "القمح",
        valueImg: "../../../assets/img/food/wheat.jpg",
        information: {
          when: {
            key: "when",
            title: "متى بدأت زراعته",
            answer:
              "وجدت اقدم اثار لقمح الخبز المستانس في العالم في وادي قلات جنوب الاردن وقد ارخت تاريخ الحبوب المتكشفة بين 9000 الى 9200 سنة بواسطة الكربون المشجع",
            question: {
              title: "متي بدأت زراعة القمح",
              options: ["قبل 9200 سنة", "قبل 8000 سنة", "قبل 6000 سنة"],
              answer: "قبل 9200 سنة"
            }
          },
          where: {
            key: "where",
            title: "أين بدأت زراعته",
            answer:
              "زرع القمح للمرة الأولي وادي قلات جنوب الاردن، ويزرع في أكثر بلاد العالم مرة واحدة في السنة وفي بعض البلدان يزرع مرتين. والقمح له أنواع متعددة جداً، فمنها ما يصلح لعمل الخبز ومنه ما يصلح لعمل المعجنات أو المعكرونة",
            question: {
              title: "أين بدأت رزاعة القمح",
              options: ["السعودية", "اليمن", "الأردن"],
              answer: "الأردن"
            }
          },
          benefits: {
            key: "benefits",
            title: "فوائده",
            answer: [
              "يُنشط الدماغ ويُقوّي الذاكرة",
              "يساعد مرضى الكبد على التحسن",
              "يُقوي مناعة الجسم",
              " يُخفف من خطر الإصابة بأمراض القلب"
            ],
            question: {
              title: "من فوائد القمح",
              options: ["يقوي المناعة", "يقوي الذاكرة", "جميع ما سبق"],
              answer: "جميع ما سبق"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "يمكن لتناول خبز القمح أنّ يؤدي إلى حدوث بعض الأضرار منها، زيادة الوزن، وحدوث حساسية عند بعض الأشخاص، وزيادة مخاطر الاصابة بسرطان المستقيم والقولون، وأيضا فقر الدم.",
            question: {
              title: "من أعراض تناول خبر القمح",
              options: ["زيادة الوزن", "تقلصات في المعدة", "الإمساك"],
              answer: "زيادة الوزن"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "الاصل في الامور الحل ما لم يأتي نص شرعي بتحريمها او لم تقاس على غيرها."
          }
        }
      }
    ],
    [
      "corn",
      {
        imgName: "../../../assets/img/vegetarian/corn.jpg",
        title: "الذرة",
        valueImg: "../../../assets/img/food/corn.jpg",
        information: {
          when: {
            key: "when",
            title: "متى بدأت زراعته",
            answer:
              "عندما غزا الاسبان الامريكتين في القرن السادس عشر وجدوا حضارة متقدمة من السكان الاصليين وكانوا مشهورين زراعة الذرة والبطاطس، ولم يعرف تاريخ زراعته بالتحديد",
            question: {
              title: "متي بدأت زراعة الذرة",
              options: ["القرن العاشر", "القرن السادس عشر", "غير معلوم"],
              answer: "غير معلوم"
            }
          },
          where: {
            key: "where",
            title: "أين بدأت زراعته",
            answer:
              "موطنها الأصلي هو جنوب المكسيك وغواتيمالا، واستعملها الهنود الحمر مصدرًا للدقيق، ثم نشرها المستعمرون الأوروبيون في أنحاء العالم القديم، كما تعد الذرة أهم محصول في الولايات المتحدة، ومن أهم الدول المنتجة له إضافة إلى الولايات المتحدة: الصين، والبرازيل، والمكسيك والأرجنتين، والهند، وفرنسا، وإندونيسيا",
            question: {
              title: "أين بدأت رزاعة ",
              options: ["أمريكا", "انجلترا", "المكسيك"],
              answer: "المكسيك"
            }
          },
          benefits: {
            key: "benefits",
            title: "فوائده",
            answer: [
              "تساهم في خفض الكولسترول",
              "تنظم ضغط الدم",
              "تحسن عمل الجهاز الهضمي",
              "تحافظ على توازن السوائل في الجسم "
            ],
            question: {
              title: "من أهم فوائد الذرة",
              options: ["خفض الكوليسترول", "تقوية المناعة", "مصدر للطاقة"],
              answer: "خفض الكوليسترول"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "يعتبر تناول الذرة آمنًا بشكل عام، لكن قد يكون لتناولها بعض الآثار الجانبية خصوصًا عند الأشخاص الذين يعتبرونها مصدرًا أساسيًا للكربوهيدرات، فقد يتعارض حمض الفايتك الموجود فيها مع امتصاص بعض المعادن كالحديد والزنك",
            question: {
              title: "من أعراض حساسية الذرة",
              options: ["زيادة الوزن", "تورم الكتفين", "لا يوجد"],
              answer: "لا يوجد"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "الاصل في الامور الحل ما لم يأتي نص شرعي بتحريمها او لم تقاس على غيرها."
          }
        }
      }
    ],
    [
      "barley",
      {
        imgName: "../../../assets/img/vegetarian/barley.jpg",
        title: "الشعير",
        valueImg: "../../../assets/img/food/barley.jpg",
        information: {
          when: {
            key: "when",
            title: "متى بدأت زراعته",
            answer:
              "يعتبر الشعير أقدم مادة استعملها الإنسان في غذائه. وقد كان من المحاصيل الغذائية الرئيسية في العصور القديمة حيث كان يصنع منه الخبز.",
            question: {
              title: "متي بدأت زراعة ",
              options: [
                "في العصور القديمة",
                "في عصر أوروبا الوسطي",
                "في العهد الإسلامي"
              ],
              answer: "في العصور القديمة"
            }
          },
          where: {
            key: "where",
            title: "أين بدأت زراعته",
            answer:
              "إستعمله سكان الشرق الأوسط منذ القدم غذاء و ذواء عالجوا به إصابات القلب و الشرايين , كما شكل الشعير الغذاء الرئيسي لجيش الرومان الذي إحتل مناطق واسعة من العالم القديم",
            question: {
              title: "أين بدأت رزاعة ",
              options: ["تونس", "اليونان", "جميع ما سبق"],
              answer: "جميع ما سبق"
            }
          },
          benefits: {
            key: "benefits",
            title: "فوائده",
            answer: [
              "تعزيز مناعة الجسم",
              "مقاومة أمراض الشيخوخة",
              "انقاص الوزن",
              "الوقاية من الإصابة بمرض السرطان"
            ],
            question: {
              title: "من فوائد الشعير",
              options: ["تقوية مناعة الجسم", "انقاص الوزن", "جميع ما سبق"],
              answer: "جميع ما سبق"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "إنّ الشعير مصدر غنيّ بالألياف، والكربوهيدرات، والبروتينات، والسكر، والأحماض الدهنيّة، والعضويّة، والأمينيّة، والكثير من المعادن، والفيتامينات، ولذلك لم تثبت الدراسات حتّى الآن أنّ للشعير أيّة أضرار",
            question: {
              title: "من أضرار الشعير",
              options: ["انخفاض ضغط الدم", "لا يوجد", "زيادة الكوليسترول"],
              answer: "لا يوجد"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "الاصل في الامور الحل ما لم يأتي نص شرعي بتحريمها او لم تقاس على غيرها."
          }
        }
      }
    ],
    [
      "beans",
      {
        imgName: "../../../assets/img/vegetarian/beans.jpg",
        title: "الفول",
        valueImg: "../../../assets/img/food/beans.jpg",
        information: {
          when: {
            key: "when",
            title: "متى بدأت زراعته",
            answer:
              "تعدّ منطقة آسيا الوسطى مركز النشوء الأصلي للفول ولا يعلم تحديدا متى بدات زراعته فبعض العلماء يرجونه الى ما قبل الميلاد 2000 سنة.",
            question: {
              title: "متي بدأت زراعة الفول",
              options: [
                "ألف عام قبل الميلاد",
                "نصف قرن قبل الميلاد",
                "ألفي عام قبل الميلاد"
              ],
              answer: "ألفي عام قبل الميلاد"
            }
          },
          where: {
            key: "where",
            title: "أين بدأت زراعته",
            answer:
              "تعد منطقة اسيا الوسطى مركز النشوء الاصلي للفول عند بعض العلماء ويرجع بعضهم الاخر الى الاغريق في اليونان وقيل انه كان محصول اساسي في مصر الفرعونية .. اما الان فهو يزرع في دول خط الاستواء بكثرة ويزرع في الصوب الصناعية حول العالم نظرا لانتشار استخدامه حول العالم",
            question: {
              title: "أين بدأت زراعة الفول",
              options: ["آسيا الوسطي", "اليونان", "كلاهما صحيح"],
              answer: "كلاهما صحيح"
            }
          },
          benefits: {
            key: "benefits",
            title: "فوائده",
            answer: [
              "غنيّ بالبروتينات، والأملاح المعدنية، مثل الحديد والفسفور.",
              "يخفّض ضغط الدّم لدى النساء في مرحلة سّن اليأس.",
              "يحافظ على مستوى السكّر في الدّم.",
              "مفيد لصحة القلب حيث يعمل على زيادة مستوى الكولسترول الجيّد في الدّم"
            ],
            question: {
              title: "من فوائد ",
              options: [
                "غني بالبروتينات",
                "يخفض ضغط الدم للنساء",
                "جميع ما سبق"
              ],
              answer: "جميع ما سبق"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "يؤدي إلى حدوث حالة مرضية تعرف بـ (تفول الدم) لدى الأشخاص الذين يعانون من الحساسية اتجاه الفول، وقد تؤدي هذه الحالة للوفاة في حالة التأخر بتقديم العلاج الأولي، كذلك يزيد اضطرابات المعدة، كعسر الهضم، والإمساك.",
            question: {
              title: "من أعراض حساسية الفول علي الجسم",
              options: ["عسر الهضم", "تفول الدم", "جميع ما سبق"],
              answer: "جميع ما سبق"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "الاصل في الامور الحل ما لم يأتي نص شرعي بتحريمها او لم تقاس على غيرها."
          }
        }
      }
    ],
    [
      "lentils",
      {
        imgName: "../../../assets/img/vegetarian/lentils.jpg",
        title: "العدس",
        valueImg: "../../../assets/img/food/lentils.jpg",
        information: {
          when: {
            key: "when",
            title: "متى بدأت زراعته",
            answer:
              "كان العدس من أوائل النباتات التي استئنسها الإنسان، قبل حوالي 13000 سنة، لذا يُعتبر من المحاصيل المؤسسة للحضارة وبعتبر موقع تل الكرخ في محافظة إدلب في سوريا أقدم موقع أكتشفت فيه بذور مزروعة للعدس",
            question: {
              title: "متي بدأت زراعة العدس",
              options: ["قبل 10000 سنة", "قبل 12000 سنة", "قبل 13000 سنة"],
              answer: "قبل 13000 سنة"
            }
          },
          where: {
            key: "where",
            title: "أين بدأت زراعته",
            answer:
              "يزرع في اغلب دول العالم و أكبر الدول بالانتاج كندا و الهند و استراليا و تركيا. ويعود أصله إلى منطقة المشرق",
            question: {
              title: "أين بدأت زراعة العدس",
              options: ["شبه الجزيرة العربية", "روما", "اليونان"],
              answer: "شبه الجزيرة العربية"
            }
          },
          benefits: {
            key: "benefits",
            title: "فوائده",
            answer: [
              "يحسن أداء الجهاز الهضمي، ويسهل عملية الهضم",
              "يُخلّص الجسم من الفضلات والسموم",
              "يقوي الجسم ويمنحه الطاقة والحيوية",
              "ينظم وزن الجسم، ويمنع السمنة"
            ],
            question: {
              title: "من فوائد العدس للجسم",
              options: [
                "يخلص الجسم من الفضلات",
                "يساعد علي انقاص الوزن",
                "جميع ما سبق"
              ],
              answer: "جميع ما سبق"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "يمكن أن يسبب محتواه العالي من الألياف الإصابة بالانتفاخ عند الأشخاض المعرضين لذلك، والأشخاص غير المعتادين على تناول كميات كبيرة من الألياف، كما أنَّه يحتوي على السكريات قصيرة السلسلة التي تزيد إنتاج الغازات، ",
            question: {
              title: "من أعراض حساسية الجسم للعدس",
              options: ["تورم الأصابع", "ارتفاع ضغط الدم", "الإصابة بالانتفاخ"],
              answer: "الإصابة بالانتفاخ"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "الاصل في الامور الحل ما لم يأتي نص شرعي بتحريمها او لم تقاس على غيرها."
          }
        }
      }
    ],
    [
      "chickpeas",
      {
        imgName: "../../../assets/img/vegetarian/chickpeas.jpg",
        title: "الحمص",
        valueImg: "../../../assets/img/food/chickpeas.jpg",
        information: {
          when: {
            key: "when",
            title: "متى بدأت زراعته",
            answer:
              "يعتبر الحمص من المواد الغذائية الغنية بالبروتين حيث أنه يشبه الفول إلى حد كبير كما يعد بديلا للحم ولذلك فقد بدات زراعته والاعتماد عليه كمحصول مكمل بشكل كبير عند شعوب اسيا الوسطى ويرجع ذلك الى ما قبل الميلاد ",
            question: {
              title: "متي بدأت زراعة الحمص",
              options: ["في العصر الحديث", "منذ قبل الميلاد", "غير معلوم"],
              answer: "منذ قبل الميلاد"
            }
          },
          where: {
            key: "where",
            title: "أين يزرع",
            answer:
              "يزرع في حوض البحر المتوسط ولا سيما إيطاليا وشمال أفريقيا والشام وتركيا",
            question: {
              title: "أين يزرع الحمص",
              options: ["شمال افريقيا", "الخليج العربي", "شرق أوروبا"],
              answer: "شمال افريقيا"
            }
          },
          benefits: {
            key: "benefits",
            title: "فوائده",
            answer: [
              "يساعد على نمو الشعر، وزيادة جمال البشرة",
              "يستخدم لأغراض الرجيم في الحمية الغذائية الصحية.",
              "يعد الحمص من أكثر الأغذية الغنية بالمعادن الضرورية",
              "يساعد في تحسين المزاج، والنوم الصحي"
            ],
            question: {
              title: "من فوائد الحمص",
              options: ["انقاص الوزن", "تحسين المزاج", "جميع ما سبق"],
              answer: "جميع ما سبق"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "يجب الحذر من تناول الحمص لبعض الأشخاص، تحت ظروف معينة مثل: الإصابة بالإسهال، ووجود الغازات في الجسم، كذلك بعض أنواع الحمص تسبب سقوط الجنين للمرأة الحامل في حالات نادرة",
            question: {
              title: "من أضرار الحمص",
              options: [
                " الإصابة بالإسهال والغازات",
                "سقوط الجنين نادرا",
                "جميع ما سبق"
              ],
              answer: "جميع ما سبق"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "الاصل في الامور الحل ما لم يأتي نص شرعي بتحريمها او لم تقاس على غيرها."
          }
        }
      }
    ],
    [
      "peas",
      {
        imgName: "../../../assets/img/vegetarian/peas.jpg",
        title: "البازلاء",
        valueImg: "../../../assets/img/food/peas.jpg",
        information: {
          when: {
            key: "when",
            title: "متى بدأت زراعته",
            answer:
              "يقال إن البازلاء كانت أول الحبوب أو المحاصيل التي أنتجها وزرعها الإنسان منذ قديم الزمان، ولأسباب كثيرة، أهمها دعم الاستقرار للقبائل الرحَّل",
            question: {
              title: "متي بدأت زراعة ",
              options: [
                "منذ العصور القديمة",
                "مع بداية العصر الحديث",
                "غير معلوم"
              ],
              answer: "منذ العصور القديمة"
            }
          },
          where: {
            key: "where",
            title: "أين بدأت زراعته",
            answer:
              "يعتقد الخبراء أن البازلاء جاءت من الشرق، خصوصًا من تركيا وسوريا والأردن وفلسطين، وانتشرت من تلك المناطق حول العالم. ويزيد البعض على تلك المناطق شمال غربي الهند وأفغانستان وجبال إثيوبيا، وحاليا تزرع في الصوب الصناعية في كل انحاء العالم لاهميتها",
            question: {
              title: "أين بدأت زراعة البازلاء",
              options: ["تركيا", "الأردن", "جميع ما سبق"],
              answer: "جميع ما سبق"
            }
          },
          benefits: {
            key: "benefits",
            title: "فوائده",
            answer: [
              "مشبعة ومصدر ممتاز للبروتينات",
              "تساعد على موازنة مستويات السكر في الدم",
              "تسهيل هضم الطعام",
              "الحماية من الإصابة ببعض الأمراض المزمنة "
            ],
            question: {
              title: "من فوائد البازلاء الشهيرة",
              options: ["مشبعة وتسهل الهضم", "مصدر للبروتينات", "جميع ما سبق"],
              answer: "جميع ما سبق"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "على الرغم من فوائد البازلاء الرائعة وقيمتها الغذائية العالية، إلا أن تناولها لا يخلو من سلبيات. إذ تحتوي البازلاء على نسبة عالية من بعض المواد التي قد تؤثر سلباً على الجهاز الهضمي وعمليات امتصاص العناصر الغذائية الهامة، وهذه المواد هي حمص الفوليك واللكتينات",
            question: {
              title: "من أعراض حساسية البازلاء علي الجسم",
              options: [
                "تؤثر علي الجهاز الهضمي",
                "تعمل علي زيادة الوزن",
                "تضعف النظر"
              ],
              answer: "تؤثر علي الجهاز الهضمي"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "الاصل في الامور الحل ما لم يأتي نص شرعي بتحريمها او لم تقاس على غيرها."
          }
        }
      }
    ],
    [
      "lettuce",
      {
        imgName: "../../../assets/img/vegetarian/lettuce.jpg",
        title: "الخس",
        valueImg: "../../../assets/img/food/lettuce.jpg",
        information: {
          when: {
            key: "when",
            title: "متى بدأت زراعته",
            answer:
              "كان المصرييون القدماء اول من زرع الخس فحولوه من حشيشه تستخدم للتسميد الى نبتة تؤكل اوراقها .. انتشر في بلاد الاغريق ثم الرومان عبر التجارة مع مصر وكان الرومان هم من اطلقوا عليه اسم الخس ثم انتشر في جميع انحاء اوروبا واسيا وافريقيا.",
            question: {
              title: "متي بدأت زراعة الخس",
              options: [
                "منذ عهد الدولة البابلية",
                "منذ 3000 عام",
                "منذ عهد المصريين القدماء"
              ],
              answer: "منذ عهد المصريين القدماء"
            }
          },
          where: {
            key: "where",
            title: "أين بدأت زراعته",
            answer:
              "شهدت الفترة الممتدة من القرن السادس عشر حتى القرن الثامن عشر ظهور عدَّة ضروب من الخس في أوروبا، وبحلول أواسط القرن الثامن عشر ظهرت الضروب الشائعة حتى الوقت الحالي. سيطرت أوروبا والولايات المتحدة على تجارة الخس العالميَّة في نهاية المطاف، وبحلول نهاية العقد الأول من القرن العشرين كان استهلاك الخس قد أصبح عالميًّا.",
            question: {
              title: "أين بدأت رزاعة الخس",
              options: ["أمريكا", "مصر القديمة", "أوروبا"],
              answer: "مصر القديمة"
            }
          },
          benefits: {
            key: "benefits",
            title: "فوائده",
            answer: [
              "المساعدة في خسارة الوزن",
              " تعزيز صحة القلب وخفض الكولسترول",
              "تعزيز صحة الجهاز الهضمي",
              "تعزيز المناعة"
            ],
            question: {
              title: "من فوائد الخس",
              options: ["تعزيز المناعة", "خسارة الوزن ", "جميع ما سبق"],
              answer: "جميع ما سبق"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "تناول الخس كثيراً يمكن أن يسبب تلون الوجه بسبب احتوائه على البيتا كاروتين، ولكن هذا اللون يذهب في حالة خفض الكمية التي تتناولها يومياً من البيتا كاروتين. والخس عامة لا يعرف له أي آثار جانبية باستثناء تلون البشرة",
            question: {
              title: "من أعراض حساسية الخس",
              options: ["جفاف العينين", "احمرار اليدين", "تلون الوجه"],
              answer: "تلون الوجه"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "الاصل في الامور الحل ما لم يأتي نص شرعي بتحريمها او لم تقاس على غيرها."
          }
        }
      }
    ],
    [
      "parsley",
      {
        imgName: "../../../assets/img/vegetarian/parsley.jpg",
        title: "البقدونس",
        section: "البذريات",
        sect: "ثنائيات الفلقة",
        valueImg: "../../../assets/img/food/parsley.jpg",
        information: {
          when: {
            key: "when",
            title: "متى بدأت زراعته",
            answer:
              "ترجع زراعة البقدونس الى الحضارات القديمة فقيل ان اول من استخدمه هم المصرييون القدامى وقيل في اوروبا الوسطى في 2000 ق.م",
            question: {
              title: "متي بدأت زراعة البقدونس",
              options: [
                "ألف عام قبل الميلاد",
                "ألفى عام قبل الميلاد",
                "ألف وخمسمائة عام قبل الميلاد"
              ],
              answer: "ألفى عام قبل الميلاد"
            }
          },
          where: {
            key: "where",
            title: "أين بدأت زراعته",
            answer:
              "ترعرع في كل بلاد العالم حيث لا تكاد تخلو منه مطابخ اوروبا واسيا وافريقيا .. كان له شعبية واسعة منذ ايام الاغريق وروما وقبل ذلك في بلاد المصريين القدامى والفينيقيين وباقي الشرق.",
            question: {
              title: "أين بدأت رزاعة البقدونس",
              options: ["آسيا", "أوروبا", "جميع ما سبق"],
              answer: "جميع ما سبق"
            }
          },
          benefits: {
            key: "benefits",
            title: "فوائده",
            answer: [
              "لعلاج التهابات المسالك البوليّة",
              "علاج حصى الكلى والمثانة",
              "يساعد في التّخلص من البكتيريا والحصوات",
              "يرفع من مستوى الجسم في مقاومة الأكسدة"
            ],
            question: {
              title: "من فوائد البقدونس",
              options: [
                "علاج إلتهابات المسالك البولية",
                "علاج حصي الكلي",
                "جميع ما سبق"
              ],
              answer: "جميع ما سبق"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "يعدّ البقدونس آمناً بالنسبة لمعظم البالغين عندما يؤخذ عن طريق الفم كدواء على المدى القصير بالكميات المعتادة، إلا أنّ وضع زيت بذور البقدونس على الجلد يمكن أن يسبب حساسية تجاه أشعة الشمس كما يؤدي إلى طفح جلدي، ومن الخطأ استهلاك كميات كبيرة جداً من البقدونس، لأنّ هذا يمكن أن يسبب آثار جانبية أخرى مثل فقر الدم ومشاكل في الكبد أو الكلى",
            question: {
              title: "من أعراض حساسية البقدونس ",
              options: ["فقر الدم", "مشاكل في القلب", "آلام بالعظام"],
              answer: "فقر الدم"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "الاصل في الامور الحل ما لم يأتي نص شرعي بتحريمها او لم تقاس على غيرها."
          }
        }
      }
    ],
    [
      "tomato",
      {
        imgName: "../../../assets/img/vegetarian/tomato.jpg",
        valueImg: "../../../assets/img/food/tomato.jpg",
        title: "الطماطم",
        section: "مغطات البذور",
        sect: "ثنائيات الفلقة",
        information: {
          when: {
            key: "when",
            title: "متى بدأت زراعتها",
            answer:
              "لم تكن نبتة الطماطم أو البندورة معروفة في بلاد الشام ومنطقة الشرق الأوسط فقد دخلت الطماطم إليها عن طريق قنصل بريطانيا في حلب جون باركر أوائل القرن التاسع عشر، ثم انتشرت زراعتها في تركيا وبلاد الشام ومصر والحجاز وقيل عنه عام 1881 أنه يؤكل ويطبخ في الشرق الأوسط منذ حوالي 40 سنة فقط",
            question: {
              title: "متي بدأت  زراعة الطماطم في الدول العربية",
              options: ["منذ 23 سنة", "منذ 43 سنة", "منذ 40 سنة"],
              answer: "منذ 40 سنة"
            }
          },
          where: {
            key: "where",
            title: "أين بدأت  زراعتها",
            answer:
              "نشأت البندورة في أمريكا الجنوبية، وانتشرت في جميع أنحاء العالم، وذلك بعد الاستعمار الإسباني للأمريكتين، وتزرع البندورة الآن على نطاق واسع، وغالبا ما تزرع في البيوت الزجاجية للحفاظ على درجة الحرارة",
            question: {
              title: "أين بدأت  زراعة الطماطم",
              options: ["شمال افريقيا", "شرق أوروبا", "أمريكا الجنوبية"],
              answer: "أمريكا الجنوبية"
            }
          },
          benefits: {
            key: "benefits",
            title: "فوائدها",
            answer: [
              "الحفاظ على صحة العين، وصحة المعدة",
              "تساهم في انخفاض ضغط الدم",
              "تساعد في الوقاية من مرض السكري",
              "المساعدة في تخفيف مشاكل الجلد، والتهابات المسالك البولية أيضًا"
            ],
            question: {
              title: "من فوائد الطماطم",
              options: [
                "انخفاض ضغط الدم",
                "الوقاية من مرض السكري",
                "جميع ما سبق"
              ],
              answer: "جميع ما سبق"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "قد تهيّج الطّماطم حساسيّة الجلد المعروفة بالأكزيما، وتزيد أعراضَها سوءاً، ومنها الحكّة الشّديدة التي تصيب مرضى الأكزيما، وتهيّج الجلد، وتورّمه، واحمراره. يُنصَح بالابتعاد عن استهلاك الطّماطم لدى الأشخاص الذين يعانون حساسيّة اللاتكس أو المطّاط؛ لأنّها قد تهيّج الجلد، وتزيد حالته سوءاً.",
            question: {
              title: "من أعراض حساسية الجسم للطماطم لمرضي الأكزيما",
              options: ["الحكة الشديده", "تهيج الجلد", "جميع ما سبق"],
              answer: "جميع ما سبق"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "الاصل في الامور الحل ما لم يأتي نص شرعي بتحريمها او لم تقاس على غيرها."
          }
        }
      }
    ],
    [
      "cucumber",
      {
        imgName: "../../../assets/img/vegetarian/cucumber.jpg",
        title: "الخيار",
        section: "مغطاة البذور",
        sect: "ثنائيات الفلقة",
        valueImg: "../../../assets/img/food/cucumber.jpg",
        information: {
          when: {
            key: "when",
            title: "متى بدأت زراعته",
            answer:
              "أصل الخيار من الهند وغرب القارة الآسيوية.وتشير الحفريات الأخيرة إلى أن سكان هذه المناطق يزرعون ويستخدمون الخيار ويطورون أنواعه المختلفة منذ 3000 عام. وأن الرومان هم الذين نقلوه من الهند إلى أوروبا. وكان الخيار من الثمار التي يأكلها أهل العراق القديم والبابلي في مدينة أور",
            question: {
              title: "متي بدأت زراعة الخيار",
              options: ["منذ 5000 عام", "منذ 3000 عام", "منذ 2500 عام"],
              answer: "منذ 3000 عام"
            }
          },
          where: {
            key: "where",
            title: "أين بدأت زراعته",
            answer:
              "يقول البعض ان الخيار انتشر في بلدان شرق اوروبا بلغاريا وكرواتيا ثم وصل لليونان ومن اليونان تلقفه اهل روما والرومان ثم انتقل للصين وحاليا يزرع في معظم دول العالم ويستخدم على نطاق واسع.",
            question: {
              title: " أين بدأت رزاعة الخيار",
              options: ["روما", "كرواتيا", "الصين"],
              answer: "كرواتيا"
            }
          },
          benefits: {
            key: "benefits",
            title: "فوائده",
            answer: [
              "ترطيب الجسم، وحمايته من الجفاف",
              "تقليل درجة حرارة الجسم",
              "حماية البشرة من الالتهابات، وحروق الشمس",
              "علاج الهالات السوداء، وانتفاخ العينين"
            ],
            question: {
              title: "من فوائد الخيار",
              options: [
                "علاج الهالات السوداء",
                "حماية الجسم من الجفاف",
                "جميع ما سبق"
              ],
              answer: "جميع ما سبق"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "قد يؤدي الإفراط في تناوله إلى الآتي: ارتفاع ضغط الدم في حال تناوله على شكل المخلل. ظهور طفح جلدي في حال امتلاك أي نوع من أنواع الحساسية اتجاه الخيار، بالإضافة للحكة، واحمرار الجلد حيناً. تورّم الأطراف السفلية والعلوية، أو العينين في حال الحساسية لبعض الأفراد. انتفاخ البطن، نتيجة تراكم الغازات. اضطربات في عملية الهضم",
            question: {
              title: "من أعراض حساسية الخيار",
              options: ["احمرار الجلد", "الحكة الشديدة", "تهيج الجلد"],
              answer: "احمرار الجلد"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "الاصل في الامور الحل ما لم يأتي نص شرعي بتحريمها او لم تقاس على غيرها."
          }
        }
      }
    ],
    [
      "apple",
      {
        imgName: "../../../assets/img/vegetarian/apple.jpg",
        title: "التفاح",
        valueImg: "../../../assets/img/food/apple.jpg",
        information: {
          when: {
            key: "when",
            title: "متى بدأت زراعته",
            answer:
              "ربما كانت شجرة التفاح أول الأشجار التي تم زراعتها، وقد حسنت ثمرتها من خلال الاختيار الزراعي على مدى آلاف السنين. يرجع الفضل إلى الإسكندر الأكبر في العثور على التفاح القزم في آسيا الصغرى عام 300 ق.م",
            question: {
              title: "متي بدأت زراعة ",
              options: [
                "قبل 2319 سنة من الآن",
                "قبل 3219 سنة من الآن",
                "قبل  2500 سنة من الآن"
              ],
              answer: "قبل 2319 سنة من الآن"
            }
          },
          where: {
            key: "where",
            title: "أين بدأت زراعته",
            answer:
              "في آسيا و‌أوروبا لآلاف السنين، وكذلك في الأرجنتين وفي الولايات المتحدة منذ وصول الأوروبيين. تم نقل التفاح إلى أمريكا الشمالية مع المستعمرين في القرن السادس عشر وحاليا تعتبر الصين ثاني اكبر مصدر للتفاح في العالم بعد امريكا .",
            question: {
              title: "أين بدأت زراعة التفاح",
              options: ["آسيا", "أوروبا", "كلاهما"],
              answer: "كلاهما"
            }
          },
          benefits: {
            key: "benefits",
            title: "فوائده",
            answer: [
              "المساعدة في الهضم",
              " الوقاية من السرطان",
              "علاج فقر الدم",
              "السيطرة على مرض السكري"
            ],
            question: {
              title: "من فوائد التفاح",
              options: ["الوقاية من السرطان", "علاج فقر الدم", "جميع ما سبق"],
              answer: "جميع ما سبق"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "يعدّ تناول ثمار التفاح دون البذور آمناً في معظم الحالات، كما أنّه لا توجد آثار جانبيّة ارتبطت بتناول عصير التفاح أو ثماره، لكنّ بذور هذا النوع من الفواكه تحتوي على السيانيد وهي مادة سامّة يتمّ إفرازها في المعدة عند تناول البذور، ويمكن أن تأخذ عدّة ساعات حتى تظهر أعراض التسمّم",
            question: {
              title: "لا يجب تناول التفاح ببذوره لإحتوائها علي",
              options: ["السموم", "البكتريا الضارة", "الميكروبات"],
              answer: "السموم"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "الاصل في الامور الحل ما لم يأتي نص شرعي بتحريمها او لم تقاس على غيرها."
          }
        }
      }
    ],
    [
      "orange",
      {
        imgName: "../../../assets/img/vegetarian/orange.jpg",
        title: "البرتقال",
        valueImg: "../../../assets/img/food/orange.jpg",
        information: {
          when: {
            key: "when",
            title: "متى بدأت زراعته",
            answer:
              "تاريخ زراعته في الصين وجنوب شرقي آسيا بشكل عام يعود الى 4 آلاف سنة قبل الميلاد. ومن هناك انتشر البرتقال في شمال افريقيا",
            question: {
              title: "متي بدأت زراعة البرتقال",
              options: [
                "قبل ستة آلاف عام",
                "قبل أربعة آلاف عام",
                "قبل ثلاثة آلاف عام"
              ],
              answer: "قبل أربعة آلاف عام"
            }
          },
          where: {
            key: "where",
            title: "أين تتم زراعته",
            answer:
              "تعد البرازيل هي الدولة الأولى في إنتاج البرتقال في العالم وتليها الولايات المتحدة ثم المكسيك ثم الهند و‌الصين و‌إسبانيا و‌إيطاليا ثم إيران و‌مصر و‌باكستان",
            question: {
              title: "ما هي البلد الأم لإنتاج البرتقال",
              options: ["الصين", "مصر", "البرازيل"],
              answer: "البرازيل"
            }
          },
          benefits: {
            key: "benefits",
            title: "فوائده",
            answer: [
              "حماية القلب من الإصابة بالجلطات المفاجئة",
              "علاج أمراض الربو والتهاب القصبات الحادة",
              "التخفيف من أعراض البرد والإنفلونزا",
              "تنقية الأوعية الدموية والشرايين من الكولسترول"
            ],
            question: {
              title: "يستخدم البرتقال لعلاج عديد الأمراض منها",
              options: ["جلطات القلب", "الإنفلونزا", "جميع ما سبق"],
              answer: "جميع ما سبق"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "يعتبر تناول البرتقال امن تماما صحيا ولا يسبب اي ضرر او حساسية لكن الافراط فيه قد يسبب حرقة المعدة: يحتوى البرتقال على نسبة عالية من الحموضة، لذلك الإفراط فى تناوله يؤدى إلى زيادة الحموضة فى المعدة.",
            question: {
              title: "من أعراض تناول البرتقال بكثرة",
              options: [
                "زيادة معدل نبضات القلب",
                "زيادة الحموضة في المعدة",
                "الشعور بالخمول"
              ],
              answer: "زيادة الحموضة في المعدة"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "الاصل في الامور الحل ما لم يأتي نص شرعي بتحريمها او لم تقاس على غيرها."
          }
        }
      }
    ],
    [
      "banana",
      {
        imgName: "../../../assets/img/vegetarian/banana.jpg",
        title: "الموز",
        valueImg: "../../../assets/img/food/banana.jpg",
        information: {
          when: {
            key: "when",
            title: "متى بدأت زراعته",
            answer:
              "قبل استهلاك الموز من قبل الحضارة البشرية كان مليئا بالبذور الصلبة الغير صالحة للاكل ولكن بعد تعديله جينيا اصبح هناك نوعين فقط من اصل اكثر من 1000 نوع وذلك في القرن التاسع عشر لكن تعود اصول الشجرة الى قبل 7000 عام من يومنا هذا",
            question: {
              title: "متي بدأت زراعة الموز",
              options: ["قبل 6000 عام", "قبل 7000 عام", "قبل 5000 عام"],
              answer: "قبل 7000 عام"
            }
          },
          where: {
            key: "where",
            title: "أين تتم زراعته",
            answer:
              "تشتهر دول شرق اسيا مثل الفلبين واندونيسيا بزراعة الموز ويزرع الموز بكميات تجارية في الوطن العربي. وتعتبر الصومال وموريتانيا والسودان من أكبر الدول المنتجة للموز. كما يتم زراعته بنجاح في كل من مصر والمنطقة الجنوبية في السعودية في جيزان وفي عمان، بالاضافة إلى اليمن والمغرب وتونس والجزائر وفي غور الأردن",
            question: {
              title: "أين يزرع الموز بكميات كبيرة",
              options: ["مصر", "الصومال", "جميع ما سبق"],
              answer: "جميع ما سبق"
            }
          },
          benefits: {
            key: "benefits",
            title: "فوائده",
            answer: [
              "تحسين الهضم",
              "تنظيم ضغط الدم",
              "يمدك بالطاقة",
              "مفيد لصحة الأمعاء"
            ],
            question: {
              title: "من فوائد الموز",
              options: [
                "يمد الجسم بالطاقة",
                "يزيد الوزن",
                "يزيد من قوة المناعة"
              ],
              answer: "يمد الجسم بالطاقة"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "يعتبر استخدام الموز امن بشكل كامل بعيدا عن الافراط فيه الذي قد يسبب زيادة في الوزن ناتج عن سعراته الحرارية العالية وقد يسبب الصداع النصفي وتسوس الاسنان ونتيجة لمستويات البوتاسيوم العالية قد يؤثر على مرضى الكلى",
            question: {
              title: "من أعراض الإفراط في الموز",
              options: ["زيادة في الوزن", "تسوس الأسنان", "جميع ما سبق"],
              answer: "جميع ما سبق"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "الاصل في الامور الحل ما لم يأتي نص شرعي بتحريمها او لم تقاس على غيرها."
          }
        }
      }
    ],
    [
      "pomegranate",
      {
        imgName: "../../../assets/img/vegetarian/pomegranate.jpg",
        title: "الرمان",
        valueImg: "../../../assets/img/food/pomegranate.jpg",
        information: {
          when: {
            key: "when",
            title: "متى بدأت زراعته",
            answer:
              "ورد ذكر الرمان في القرآن الكريم ، وما زال اليهود يستعملون الرمان في بعض طقوسهم الدينية ، عرف الرومان والاغريق والفراعنة الرمان ، وظهر ذلك في نقوشهم على جدران المعابد والمنحوتات .لا نعرف أصل الرمان بالتحديد ( ربما جاء من شمال أفريقيا ) لكننا نعرف أنه نقل الى بابل قبل خمسة آلاف سنة , ونعرف أن الأطباء القدماء في اليونان وروما و الهند و الصين و ارمينيا قد إستعملوه",
            question: {
              title: "متي بدأت زراعة الرمان",
              options: [
                "قبل خمسة آلاف عام",
                "قبل ستة آلاف عام",
                "قبل سبعة آلاف عام"
              ],
              answer: "قبل خمسة آلاف عام"
            }
          },
          where: {
            key: "where",
            title: "أين بدأت زراعته",
            answer:
              "وأصل الرمان من آسيا وتحديداً إيران والهند ، وانتقل انتشاره من بر الشام ( سوريا ، الاردن ، فلسطين ، ولبنان ) الى شمال افريقيا ومصر وحوض الابيض المتوسط وتشتهر منطقة الباحة في المملكة العربية السعودية بزراعته بكميات كبيرة ومحصول ضخم.",
            question: {
              title: "أين بدأت زراعة الرمان",
              options: ["الصين", "الهند", "باكستان"],
              answer: "الهند"
            }
          },
          benefits: {
            key: "benefits",
            title: "فوائده",
            answer: [
              "مضاد اكسده طبيعي",
              "يعزز الجهاز الهضمي",
              "يكافح السكري",
              "يقوي الذاكرة"
            ],
            question: {
              title: "من فوائد الرمان للجسم",
              options: [
                "يقوي الذاكرة",
                "يدعم الجسم بمضادات الأكسدة",
                "جميع ما سبق"
              ],
              answer: "جميع ما سبق"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "يعد شرب عصير الرمان آمناً عند أغلب الأشخاص، ولكنّ بعض الأشخاص قد يعانون من ردّ فعلٍ تحسّسي اتجاه فاكهة الرمان، ويمكن القول إنّ تناول مستخلص الرمان أو وضعه على الجلد آيُعدذ أمراً امناً، إلّا أنّ هذا المستخلص قد يسبّب الحساسية لبعض الأشخاص، والتي قد تؤدي إلى ظهور بعض الأعراض كالحكة، والانتفاخ، وسيلان الأنف، وصعوبة التنفس، كما تجدر الإشارة إلى أنّ تناول جذور الرمان، أو سيقانه، أو قشوره بكمياتٍ كبيرةٍ يُعدّ أمراً غير آمن؛ حيث إنّ هذه الأجزاء تحتوي على السموم",
            question: {
              title: "يعد تناول قشور الرمان خطير",
              options: [
                "لتلوثها",
                "لإحتوائها علي سموم",
                "لإحتوائها علي بكتريا ضارة"
              ],
              answer: "لإحتوائها علي سموم"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "الاصل في الامور الحل ما لم يأتي نص شرعي بتحريمها او لم تقاس على غيرها."
          }
        }
      }
    ],
    [
      "tobacco",
      {
        imgName: "../../../assets/img/vegetarian/tobacco.jpg",
        title: "التبغ",
        valueImg: "../../../assets/img/food/tobbaco.jpg",
        information: {
          when: {
            key: "when",
            title: "متى بدأت زراعته",
            answer:
              "مع أكتشاف كريستوفر كولمبوس لقارة أمريكا عرف العالم التبغ عن طريقه حيث أهداه السكان الأصليون التبغ وبعد فترة جلب البحارة التبغ معهم وهم عائدون إلى قارة أوروبا. منذ ذلك الوقت بدأالتبغ في الأنتشار في أوروبا",
            question: {
              title: "متي بدأت زراعة التبغ",
              options: [
                "مع السكان الأصليين لأمريكا",
                "مع دخول أوروبا للأمريكتين",
                "بعد انتهاء الحرب العالمية الأولي"
              ],
              answer: "مع السكان الأصليين لأمريكا"
            }
          },
          where: {
            key: "where",
            title: "أين بدأت زراعته",
            answer:
              " يعود تاريخ زراعة التبغ إلى القارة الأمريكية حيث استخدمها السكان الأصليون في طقوسهم الدينية باعتبارها مسكنًا للأوجاع.",
            question: {
              title: "أين بدأت زراعة التبغ",
              options: ["أمريكا", "الصين", "إيران"],
              answer: "أمريكا"
            }
          },
          benefits: {
            key: "benefits",
            title: "أضراره",
            answer: [
              "يؤثر علي الحمل للنساء",
              "يؤثر علي الصحة الجنسية للرجل",
              "يحتوي علي سموم كالنيكوتين، مما قد يسبب الوفاة"
            ],
            question: {
              title: "من أضرار التبغ علي صحة الإنسان",
              options: ["يسبب الوفاة", "يؤثر علي الحمل", "جميع ما سبق"],
              answer: "جميع ما سبق"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "يشعر المدخن بالمتعة لحظة دخول النيكوتين الى الجهاز العصبي، ولكن في حال تلاشيه يتم إستبدال شعور المتعة باخر غير مريح، بحيث قد تصيبك عدة أعراض منها: مشكلة في التركيز، وكذلك العصبية، أيضا آلام في الرأس وزيادة الشهية",
            question: {
              title: "من أعراض شرب سجائر التبغ",
              options: ["ضعف التركيز", "تورم القدمين", "تقلص المعدة"],
              answer: "ضعف التركيز"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "هو محرم بلا شك؛ لأنه يشتمل على أضرار كثيرة بينها الأطباء وبينها من استعمله. فالواجب على كل مسلم تركه والحذر منه؛ لأن الله حرم على المؤمن أن يضر نفسه، فهو يقول سبحانه: (وَلا تُلْقُوا بِأَيْدِيكُمْ إِلَى التَّهْلُكَةِ)، ويقول جل وعلا: (وَلا تَقْتُلُوا أَنفُسَكُمْ إِنَّ اللَّهَ كَانَ بِكُمْ رَحِيمًا)"
          }
        }
      }
    ],
    [
      "coca",
      {
        imgName: "../../../assets/img/vegetarian/coca.jpg",
        title: "الكوكا",
        valueImg: "../../../assets/img/food/coca.jpg",
        information: {
          when: {
            key: "when",
            title: "متى بدأت زراعته",
            answer:
              "اعتبره كثير من الأطباء في البداية معجزة في عالم الدواء. وفي أواخر القرن التاسع عشر، وصفه الأطباء دواءً لجميع أنواع الاعتلالات العقلية والبدنية، بما فيها الإرهاق والإحباط، ومعاقرة الخمور وإدمان المورفين. واحتوى كثير من الأدوية المرخص بها في ذلك الوقت على الكوكايين، لذلك صار المخدر واسع الاستخدام",
            question: {
              title: "متي بدأت زراعة الكوكا",
              options: [
                "مع سكان الأمريكتين الأصليين",
                "مع التجارب العلمية الحديثة",
                "جميع ما سبق"
              ],
              answer: "مع سكان الأمريكتين الأصليين"
            }
          },
          where: {
            key: "where",
            title: "أين بدأت زراعته",
            answer:
              "دأب الهنود الحمر الذين يعيشون في جبال الأنديز في أمريكا الجنوبية على مضغ أوراق الكوكا لآلاف السنين. وهذا لايولد شعوراً بالنشوة، لكنه يقلل الإحساس بالتعب والجوع. اكتشف أحد العلماء الألمان كيفية استخراج الكوكايين من أوراق الكوكا في منتصف القرن التاسع عشر.",
            question: {
              title: "أين بدأت زراعة ",
              options: ["جبال الهيمالايا", "جبال الأطلس", "جبال الأنديز"],
              answer: "جبال الأنديز"
            }
          },
          benefits: {
            key: "benefits",
            title: "أضراره",
            answer: [
              "اضطراب في المعدة والجهاز الهضمي",
              "ارتفاع معدل ضربات القلب",
              "ظهور بعض السلوكيات السلبية",
              "اتساع حدقة العين"
            ],
            question: {
              title: "من أضرار مخدر الكوكايين",
              options: [
                "اتساع حدقة العين",
                "انخفاض معدل ضربات القلب",
                "ظهور بقع في الوجه"
              ],
              answer: "اتساع حدقة العين"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "للكوكايين أعراض عديدة سلبية علي الجسم منها، تدافع الأفكار وعدم القدرة على تحليل الأمور مثل الأشخاص الطبيعيين،وأيضا أعراض نفسية واضحة مثل العظمة و الهلوسة وجنون العظمة. كذلك الدخول في الغيبوبة على فترات متباعدة وخصوصا عند زيادة الجرعة التي تعطي الشخص المريض.",
            question: {
              title: "من أعراض تعاطي الكوكايين",
              options: ["جنون العظمة", "تدافع الأفكار", "جميع ما سبق"],
              answer: "جميع ما سبق"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "هو محرم بلا شك؛ لأنه يشتمل على أضرار كثيرة بينها الأطباء وبينها من استعمله. فالواجب على كل مسلم تركه والحذر منه؛ لأن الله حرم على المؤمن أن يضر نفسه، فهو يقول سبحانه: (وَلا تُلْقُوا بِأَيْدِيكُمْ إِلَى التَّهْلُكَةِ)، ويقول جل وعلا: (وَلا تَقْتُلُوا أَنفُسَكُمْ إِنَّ اللَّهَ كَانَ بِكُمْ رَحِيمًا)"
          }
        }
      }
    ],
    [
      "cannabis",
      {
        imgName: "../../../assets/img/vegetarian/cannabis.jpg",
        title: "الحشيش",
        valueImg: "../../../assets/img/food/cannabis.jpg",
        information: {
          when: {
            key: "when",
            title: "متى بدأت زراعته",
            answer:
              "والحشيش أكثر المخدرات انتشارا في العالم نظرا لرخص ثمنه وسهوله تعاطيه فهو لا يلزمه ادوات معقده مثل سرنجات الأبر أو غيرها وأوراق نبات القنب تحتوي مواداً كيميائية كرباعي هيدرو كانابينول وكميات صغيرة من مادة تشبة الأتروبين تسبب جفاف الحلق، ولكن لا يعرف تحديدا متي بدأت زراعته وانتاجه",
            question: {
              title: "متي بدأت زراعة ",
              options: ["منذ العصر الحجري", "منذ العصر الحديث", "غير معلوم"],
              answer: "غير معلوم"
            }
          },
          where: {
            key: "where",
            title: "أين تتم زراعته",
            answer:
              "مخدر يُصنع من القنب الهندي، والتي يتم زراعتها في المناطق الاستوائية والمناطق المعتدلة. والحشيش هو السائل المجفف من المادة الصمغية بينما الماريغوانا تستهلك بشكل عشبي.",
            question: {
              title: "أين تتم زراعة الحشيش",
              options: ["المناطق الإستوائية", "المناطق المعتدلة", "كلاهما"],
              answer: "كلاهما"
            }
          },
          benefits: {
            key: "benefits",
            title: "أضراره",
            answer: [
              "التهاب القصبات الهوائية وأمراض الرئة",
              "تخدير الجهاز العصبي",
              "يسبب أمراض القلب",
              "تشويه الجنين"
            ],
            question: {
              title: "من أضرار الحشيش علي الصحة ",
              options: ["التهاب القصبات الهوائية", "يضر القلب", "كلاهما"],
              answer: "كلاهما"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "يظهر التأثير خلال بضع دقائق بعد التدخين، ويستمر من 2 إلى 5 ساعات. في حال تناوله مع الطعام يظهر التأثير خلال ساعة، وفيها يشعر المتعاطي بشهية قوية للطعام، ويشعر بطيبة الطعام والروائح غير مماثلة للعادة. كما أنَّ يصبح كلَّ شيء أكثر وضوحاً وتميّزاً.",
            question: {
              title: "من أعراض تعاطي الحشيش",
              options: ["وضوح الأشياء", "شهية للطعام", "كلاهما"],
              answer: "كلاهما"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "هو محرم بلا شك؛ لأنه يشتمل على أضرار كثيرة بينها الأطباء وبينها من استعمله. فالواجب على كل مسلم تركه والحذر منه؛ لأن الله حرم على المؤمن أن يضر نفسه، فهو يقول سبحانه: (وَلا تُلْقُوا بِأَيْدِيكُمْ إِلَى التَّهْلُكَةِ)، ويقول جل وعلا: (وَلا تَقْتُلُوا أَنفُسَكُمْ إِنَّ اللَّهَ كَانَ بِكُمْ رَحِيمًا)"
          }
        }
      }
    ],
    [
      "goose",
      {
        title: "الأوز",
        imgName: "../../../assets/img/animal/goose.jpg",
        valueImg: "../../../assets/img/food/goose.jpg",
        information: {
          when: {
            key: "when",
            title: "متى بدأت تربيته",
            answer:
              "غير معلوم بالتحديد متى بدا الانسان في تربية الاوز ومن اول من قام بذلك لكن يقال في بعض الروايات ان الهنود الحمر هما اول من قام بتربية الاوز بغرض الاكل",
            question: {
              title: "متي بدأت تربية الأوز",
              options: ["منذ قبل الميلاد", "منذ العصر الحجري", "غير معلوم"],
              answer: "غير معلوم"
            }
          },
          where: {
            key: "where",
            title: "أين يتواجد",
            answer:
              "يعيش الاوز في المناطق المعتدله ويتواجد بشكل نادر في المناطق الاستوائية. يتواجد من 4-5 سلالات من النصف الشمالي من الكره الأرضية, وتتواجد سلاله واحده في أستراليا ونيوزيلانده وسلاله أخيرة في أمريكا الجنوبية. ولا تتواجد أي اوز في المناطق الاستوائية",
            question: {
              title: "أين يتواجد الأوز بكثره",
              options: [
                "المناطق المعتدلة",
                "المناطق الإستوائية",
                "المناطق الباردة"
              ],
              answer: "المناطق المعتدلة"
            }
          },
          benefits: {
            key: "benefits",
            title: "فوائده",
            answer: [
              "يساعد على تحسين الجهاز العصبي",
              "يبطئ تطور الخلايا السرطانية في الجسم",
              "يعزز ويقوي الجهاز المناعي",
              "يمنع تطور أمراض القلب والأوعية الدموية"
            ],
            question: {
              title: "من فوائد لحم الأوز",
              options: ["يمنع تطور أمراض القلب", "يقوي المناعة", "كلاهما"],
              answer: "كلاهما"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "الاعتدال في اكل كل شيء هو الاصل وبهذه القاعدة يعتبر الاوز امنا بشكل كامل لكن الاكثر منه يسبب بعض الاضرار نتيجة الدهون الزائدة في جلده ولحمه نظرا لانه حيوان مائي والدهون تساعد في التدفئة لذلك قد يسبب السمنة وضعف المناعة في حال الاكثار من تناوله.",
            question: {
              title: "من أعراض الإفراط في تناول الأوز",
              options: ["يسبب السمنه", "ضعف المناعة", "كلاهما"],
              answer: "كلاهما"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "الاصل في الامور الحل ما لم يأتي نص شرعي بتحريمها او لم تقاس على غيرها."
          }
        }
      }
    ],
    [
      "pigeon",
      {
        title: "الحمام",
        imgName: "../../../assets/img/animal/pigeon.jpg",
        valueImg: "../../../assets/img/food/pigeon.jpg",
        information: {
          when: {
            key: "when",
            title: "علاقة الإنسان بالحمام",
            answer:
              "يحكى أن ملِكين خرجا للحرب متخاصمين.. وقبل وقوع المعركة أمر أحد الملكين بإحضار سلاحه وخوذته، فأخبره الجنود أن حمامةً بيضاء بنت عشها داخل خوذته والخوذة فوق سلاحه، فأبى أن يؤذيها ويزعجها مع فراخها ويخرّب بيتها، فتركها وانطلق إلى ميدان المعركة دون عتاد حرب.. عندما رأى الملك الآخر خصمه بلا سلاح، دفعه الفضول إلى معرفة السبب، فدعاه إلى التفاوض والمناقشة، وحين علم أنه خاطر بنفسه وتخلى عن خوذته وسلاحه رحمةً بحمامة، عدَل عن الحرب وأبرم اتفاقية سلام معه. ومنذ ذلك الحين ظلت الحمامة البيضاء رمز السلام والحب",
            question: {
              title: "نستنتج من القصة أن الحمام",
              options: ["يدعو للسلام", "يدعو للحرب", "يدعو للتشاحن"],
              answer: "يدعو للسلام"
            }
          },
          where: {
            key: "where",
            title: "أين يتواجد ",
            answer:
              "انتشرت تربية الحمام في انحاء العالم سواء للزينة او للطعام وتختلف الانواع بختلاف اسباب التربية والظروف البيئة .",
            question: {
              title: "أين يتواجد الحمام",
              options: ["شرق أوروبا", "شمال أفريقيا", "كلاهما"],
              answer: "كلاهما"
            }
          },
          benefits: {
            key: "benefits",
            title: "فوائده",
            answer: [
              "يقوّي جهاز المناعة، وذلك لأنه يحتوي على نسبة عالية من فيتامين جـ",
              "يقوي الأظافر والأسنان، ويقلل من خطر الإصابة بداء هشاشة العظام",
              "يحتوي على كمية كبيرة من حمضي أوميجا_6 وأوميجا_3",
              "يوفر الحماية للغدة الدرقية من المشاكل المختلفة والإصابات"
            ],
            question: {
              title: "من فوائد لحم الحمام",
              options: [
                "توفير حمضي الأوميجا",
                "يقوي الأظافر والأسنان",
                "كلاهما"
              ],
              answer: "كلاهما"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "من الممكن أن تصبح الأطعمة الغنية بالعناصر الغذائية ضارة إذا لم يتم الالتفات إلى القواعد الآمنة لتناولها، فعلى سبيل المثال، عند الإفراط في تناول لحم الحمام فإنه يؤثر سلبًا على صحة الجسم حيث يحتوي على نسبة وفيرة من الدهون خاصة الجلد.",
            question: {
              title: "من أعراض الإفراط في تناول الحمام",
              options: ["زيادة الوزن", "زيادة نسبة الدهون", "كلاهما"],
              answer: "كلاهما"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "الاصل في الامور الحل ما لم يأتي نص شرعي بتحريمها او لم تقاس على غيرها."
          }
        }
      }
    ],
    [
      "rooster",
      {
        title: "الديك الرومي",
        imgName: "../../../assets/img/animal/rooster.jpg",
        valueImg: "../../../assets/img/food/rooster.jpg",
        information: {
          when: {
            key: "when",
            title: "شكل الديك الرومي",
            answer:
              "الديك الرومي البرّي الذكر البالغ يكون بلا ريش صغير، ذو رأس محمّرِ الذي يمكن أن يغير إلى الأزرق في دقائق وله حنجرة حمراء أو برتقالي محمّر إلى السيقان الرمادية الزرقاء مع جسم أسمر غامق إلى أسود.الديك الرومي له ذيل على هيئة نصير مظلم وأجنحة برونزية لمّاعة. إنّ الذكر أكبر جوهرياً من الأنثى، وريشه له مناطق نحاسية خضراء إرجوانية حمراء، برونز، ومتخيّف ألوان ذهبي",
            question: {
              title: "يتميز شكل الديك الرومي بوجود",
              options: ["أجنحة لماعة", "رأس حمراء تتغير للأزرق", "كلاهما"],
              answer: "كلاهما"
            }
          },
          where: {
            key: "where",
            title: "أين يتواجد الديك الرومي",
            answer:
              "الديك الرومي البري أو الحَبَش البَرِّيّ موطنه امريكا الشمالية ويربى حاليا في معظم انحاء العالم لما له من قيمة كبيرة في الاطباق الفاخرة والمناسبات العامة عالميا ",
            question: {
              title: "يعد الموطن الأصلي للديك الرومي هو",
              options: ["أمريكا الشمالية", "شمال أفريقيا", "الخليج العربي"],
              answer: "أمريكا الشمالية"
            }
          },
          benefits: {
            key: "benefits",
            title: "فوائده",
            answer: [
              "يساعد في الحفاظ على نشاط وصحة الغدة الدرقية",
              "يقوم بحماية الجسم من مرض فقر الدم.",
              "يساعد في المحافظة على معدل السكر في الدم.",
              "يعمل على تنشيط الدورة الدموية."
            ],
            question: {
              title: "من فوائد لحم الديك الرومي",
              options: [
                "تنشيط الذاكرة",
                "تهدئة الجهاز الهضمي",
                "الحفاظ علي معدل سكر الدم"
              ],
              answer: "الحفاظ علي معدل سكر الدم"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "التربتوفان الموجود بدجاج الرومي يسبب الخمول و الكسل لذلك ينصح بعدم الاسراف في تناوله، كذلك تضيف بعض السيدات كميات كبيرة من الملح عند طهي دجاج الرومي مما يؤدي إلى زيادة نسبة الصوديوم ",
            question: {
              title: "من أعراض الإفراط في تناول الديك الرومي",
              options: ["الخمول والكسل", "احمرار الجلد", "الصداع"],
              answer: "الخمول والكسل"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "الاصل في الامور الحل ما لم يأتي نص شرعي بتحريمها او لم تقاس على غيرها."
          }
        }
      }
    ],
    [
      "chicken",
      {
        title: "الدجاج",
        imgName: "../../../assets/img/animal/chicken.jpg",
        valueImg: "../../../assets/img/food/chicken.jpg",
        information: {
          when: {
            key: "when",
            title: "متى بدأت تربيته",
            answer:
              "بدأت عملية التدجين أو تربية الدواجن لغرض الأكل قبل 7000 إلى 10000 عام. وعلى حد قول البروفيسور في جامعة أوكسفورد، الدكتور جريجور لارسون، فإن الدجاج لم يكن غذاء للإنسان في سالف العصور، بل كانت تربطه بالبشر علاقات أخرى كاستخدامه في طقوس معينة أو المشاركة به في مصارعة الديوك.",
            question: {
              title: "متي بدأت تربية ",
              options: [
                "ما بين 5000 إلى 10000",
                "ما بين 7000 إلى 10000",
                "ما بين 9000 إلى 10000"
              ],
              answer: "ما بين 7000 إلى 10000"
            }
          },
          where: {
            key: "where",
            title: "أين يتواجد ",
            answer:
              "بحسب الأحصائيات فإنه يتم ذبح حوالي 58 مليار دجاجة كل عام حول العالم، و يبلغ إجمالي إنتاج لحوم الدجاج في العالم حوالي 90 مليون طن سنويا، و أكبر دولة منتجة للحوم الدواجن هي الولايات المتحدة الأمريكية، و يمثل إنتاجها حوالي خمس إنتاج لحوم الدجاج في العالم، تليها دولتي الصين و البرازيل",
            question: {
              title: "أين يتواجد الدجاج",
              options: ["الصين", "البرازيل", "كلاهما"],
              answer: "كلاهما"
            }
          },
          benefits: {
            key: "benefits",
            title: "فوائده",
            answer: [
              "محاربة نموّ وانتشار الشوارد الحرّة في خلايا الجسم",
              "يحدّ من نمو الأورام السرطانيّة بمختلف أنواعها",
              "يساعد في تخفيض نسبة ضغط الدم المرتفعة في الجسم",
              "يعمل على تحفيز نموّ العضلات وتقويتها"
            ],
            question: {
              title: "من فوائد لحم الدجاج",
              options: [
                "ينمي العضلات",
                "رفع ضغط الدم",
                "دعم الجسم بالكربوهيدرات"
              ],
              answer: "ينمي العضلات"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "الإصابة بالحساسية: فرغم أنّ حساسية الدّجاج تُعتبر نادرة الحدوث، إلّا أنّ المُصابين بها معرّضون للإصابة بأعراض تتراوح بين الخفيفة والشّديدة كانتفاخ العينين وسيلان الأنف وصعوبة التّنفّس واحتقان الحلق والسُّعال وتهيُّج الجلد واحمراره والقيء والغثيان والإسهال",
            question: {
              title: "من أعراض حساسية لحم الدجاج",
              options: ["تهيج الجلد", "القيء والغثيان", "كلاهما"],
              answer: "كلاهما"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "الاصل في الامور الحل ما لم يأتي نص شرعي بتحريمها او لم تقاس على غيرها."
          }
        }
      }
    ],
    [
      "cow",
      {
        imgName: "../../../assets/img/animal/cow.jpg",
        title: "البقر",
        valueImg: "../../../assets/img/food/cow.jpg",
        information: {
          when: {
            key: "when",
            title: "قصة البقر مع الإنسان",
            answer:
              "للبقر شأن عظيم في التاريخ البشري، بل البقر قد يكون من أهم الحيوانات في تفاعلها التاريخي مع الإنسان ولليهود مع البقر قصة طويلة، حيث امتحنهم الله بأن يذبحوا واحدة فأخذوا يماطلون نبيهم، ويسألونه عن لونها، وشكلها، ويتمحكون في ذلك تمحكاً شديداً حتى نالوا عقاب ربهم",
            question: {
              title: "مما يستخلص من قصة البقر مع الإنسان معرفة",
              options: ["دهاء اليهود", "خبث اليهود", "طاعة اليهود"],
              answer: "خبث اليهود"
            }
          },
          where: {
            key: "where",
            title: "أين يتواجد",
            answer:
              "البلاد العربية متباينة جدًا في طبيعتها الجغرافية حيث إنها تغطي مساحات شاسعة في قارتي آسيا وإفريقيا. والمناطق الجافة الصحراوية تمثّل نسبة كبيرة، في أراضيها؛ فهي لذلك لا تصلح إلا للمرعى. فالرعي وتربية الحيوانات والاستفادة من منتجاتها (اللحوم والألبان) جزء لا يتجزأ من حياة سكان وقبائل البلاد العربية",
            question: {
              title: "أين يتواجد البقر",
              options: ["مصر", "السعودية", "كلاهما"],
              answer: "كلاهما"
            }
          },
          benefits: {
            key: "benefits",
            title: "فوائده",
            answer: [
              "يساعد في تنظيم مستوى السكّر في الدم",
              "زيادة قوة جهاز المناعة، ممّا يؤدي إلى زيادرة قدرة الجسم على مقاومة الأمراض",
              "مساعدة خلايا الجسم في سرعة الشفاء والالتئام عند الإصابة بالجروح",
              "حماية الجسم من الإصابة بفقر الدم "
            ],
            question: {
              title: "من فوائد لحم البقر",
              options: [
                "تنظيم الدورة الدموية",
                "تنظيم مستوي السكر في الدم",
                "تنظيم النوم"
              ],
              answer: "تنظيم مستوي السكر في الدم"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "قد يسبّب تناول لحم البقر بالكميّات غير الصحيّة و بالطرق غير الصحيحة الإصابة باضطرابات في المعدة؛ حيث قد يصاب الشخص بالإسهال أو الإمساك، كما يجب الحذر من تناول اللحوم النيئة أو قليلة الطهو؛ فقد تحتوي على مسبّبات الأمراض، لذلك يجب طهوها جيّداً قبل تناولها.",
            question: {
              title: "من أعراض الإفراط في تناول لحم البقر",
              options: ["الإسهال", "الإمساك", "كلاهما"],
              answer: "كلاهما"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "الاصل في الامور الحل ما لم يأتي نص شرعي بتحريمها او لم تقاس على غيرها."
          }
        }
      }
    ],
    [
      "rabbit",
      {
        imgName: "../../../assets/img/animal/rabbit.jpg",
        title: "الأرنب",
        valueImg: "../../../assets/img/food/rabbit.jpg",
        information: {
          when: {
            key: "when",
            title: "تعرف عن الأرانب",
            answer:
              "حيوان ثدي مستأنس يربيه الناس من أجل لحومه وفرائه الناعم، كما أنه يربى أحياناً كحيوان أليف لم يكن شأنه شأن القطط والكلاب. تتطلب تربية الأرانب عناية خاصة، ذلك أنها من الحيوانات شديدة الحساسية للأمراض والظروف البيئية المختلفة",
            question: {
              title: "ماذا تعرف عن الأرانب",
              options: ["له فرو ناعم", "تربيته تتطلب العناية الخاصة", "كلاهما"],
              answer: "كلاهما"
            }
          },
          where: {
            key: "where",
            title: "أين يتواجد",
            answer:
              "تستوطن جميع قارات وبلدان العالم باستثناء القارة القطبية الجنوبية وأستراليا",
            question: {
              title: "لا تعيش الأرانب في",
              options: ["البحرين", "اليونان", "أستراليا"],
              answer: "أستراليا"
            }
          },
          benefits: {
            key: "benefits",
            title: "فوائده",
            answer: [
              "يعمل علي خفض ضغط الدم",
              "تفيد في صحة الأسنان والعظام، حيث إنّه يحتوي على نسب جيدة من الكالسيوم",
              "يساعد في المحافظة على صحة الجهاز العصبي",
              "يقوي جهاز المناعة في الجسم ويحد من السكتات الدماغية وذلك لأنه يحتوي على المغنيسيوم والبوتاسيوم."
            ],
            question: {
              title: "من فوائد لحم الأرانب",
              options: ["تقوية المناعة", "الحد من السكتات الدماغية", "كلاهما"],
              answer: "كلاهما"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "يعد لحم الارانب من اجود اللحوم ولا يوجد اي اضرار لتناوله بعتدال بل بالعكس بوجود فوائد عظيمة له",
            question: {
              title: "هل توجد أعراض جانبية لتناول لحوم الأرانب",
              options: ["نعم", "لا", "ربما"],
              answer: "لا"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "الاصل في الامور الحل ما لم يأتي نص شرعي بتحريمها او لم تقاس على غيرها."
          }
        }
      }
    ],
    [
      "camel",
      {
        imgName: "../../../assets/img/animal/camel.jpg",
        title: "الإبل",
        valueImg: "../../../assets/img/food/camel.jpg",
        information: {
          when: {
            key: "when",
            title: "تاريخ الإبل مع الإنسان",
            answer:
              "علاقة الانسان العربي بالابل علاقة قديمة تضرب بجذورها في أعماق التاريخ حيث استطاع تدجينها منذ عصور موغلة في القدم الى حوالي أربعين قرنا ويطلق على الجمل سفينة الصحراء وهو وصف مثالي ينطبق عليه تماما نظراً لقدراته العجيبية على تحمل المشاق وصبره على احتمال العطش في هجير الصحراء وحرها اللافح وهو يقطع الفيافى والقفار رفيقا لصاحبه في الصحراء الموحشة في حله وترحاله الطويل.",
            question: {
              title: "منذ متي بدأت علاقة الإنسان مع الإبل",
              options: ["أربعين قرنا", "خمسين قرنا", "ثلاثين قرنا"],
              answer: "خمسين قرنا"
            }
          },
          where: {
            key: "where",
            title: "أين يتواجد",
            answer:
              " الجمل الوحيد السنام، البعير العربي، الإبل العربية، والهجين في بعض الأحيان. لا يُعرف على وجه التحديد الموطن الأصلي للجمل العربي البرّي ولكن يُحتمل بأن يكون شبه الجزيرة العربية. يعيش الشكل المستأنس من هذه الجمال اليوم في شمال أفريقيا، الشرق الأوسط، وشمال الهند  وقد احتلت الابل مكانة مرموقة عند الانسان العربي",
            question: {
              title: "أين يتواجد الإبل",
              options: ["شمال الهند", "جنوب الهند", "كلاهما"],
              answer: "شمال الهند"
            }
          },
          benefits: {
            key: "benefits",
            title: "فوائده",
            answer: [
              "يمد الجسم بالبروتين، وفيتامين د، والحديد، والأملاح المعدنية",
              "يعالج بعض أمراض القلب، ويحد من الإصابة بالنوبات والسكتات القلبية الخطيرة",
              "يقي من أمراض السرطان؛ لأنه يتكون من كمية كبيرة من الدهون ",
              "يمنح الجسم طاقة كبيرة، ويسهم في تجديد الخلايا"
            ],
            question: {
              title: "من فوائد لحم ",
              options: [
                "يقي من أمراض السرطان",
                "يقي من الاصابة بالايدز",
                "كلاهما"
              ],
              answer: "يقي من أمراض السرطان"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "لم تستطع الدراسات إثبات أيّ مضار للحم الإبل بشكل قاطع، وذكرت بعض الدراسات أنّ لحم الإبل يزيد من قوّة السيلان العصبي بشكل كبير، ممّا يجعل الإنسان شديد الغضب، وعند الوضوء يهدأ الإنسان ويقل السيلان العصبي الساري في جسمه",
            question: {
              title: "من أعراض الإفراط في تناول",
              options: [
                "زيادة ضربات القلب",
                "زيادة ضغط الدم",
                "زيادة السيلان العصبي"
              ],
              answer: "زيادة السيلان العصبي"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "الاصل في الامور الحل ما لم يأتي نص شرعي بتحريمها او لم تقاس على غيرها."
          }
        }
      }
    ],
    [
      "sheep",
      {
        imgName: "../../../assets/img/animal/sheep.jpg",
        title: "",
        valueImg: "../../../assets/img/food/sheep.jpg",
        information: {
          when: {
            key: "when",
            title: "متى بدأت تربيته",
            answer:
              "الخروف، قطيعه الغنم، ذكره الكبش وأنثاه النعجة، حيوان عرفه الإنسان منذ قديم الزمان، كما يطلق عليه أيضاً اسم الكبش وهو ذكر الأغنام تعدّ الأغنام الحيوان الأساسي في تاريخ الزراعة، والغنم أثر كثيرا في ثقافة الإنسان. وترتبط الأغنام غالبا بالأرياف.",
            question: {
              title: "متي بدأت تربية الغنم",
              options: ["منذ القدم", "منذ وقت حديث", "بعد صعود الإنسان للجبال"],
              answer: "منذ القدم"
            }
          },
          where: {
            key: "where",
            title: "أين يتواجد",
            answer:
              "تربى الأغنام في جميع أنحاء العالم ولعبت دوراً أساسياً في العديد من الحضارات. وفي الوقت الحالي، تعدّ أستراليا، نيوزيلندا، باتاغونيا والمملكة المتحدة المناطق الرئيسية التي تكرس لتربية المواشي وتحتل الممكلة العربية السعودية مكانة رفيعة في تربية الاغنام نظرا لزيادة الطلب عليها واستهلاكها المحلي العالي",
            question: {
              title: "أين يتواجد الغنم بكثرة",
              options: ["السعودية", "نيوزيلندا", "كلاهما"],
              answer: "كلاهما"
            }
          },
          benefits: {
            key: "benefits",
            title: "فوائده",
            answer: [
              "لحم الضأن هو مصدر جيد للبروتينات حيث يمد الجسم بحوالي 60% من احتياجه اليومي للبروتينات",
              "يحتوي لحم الضأن على كميات عالية من السيلينيوم وهو من العناصر المضادة للأكسدة",
              "تناول لحم الضأن يقي من الإصابة بالأنيميا وفقر الدم",
              "يحتوي لحم الضأن على كمية جيدة من الزنك الذي يحتاجه الجسم للنمو كما أنه مقوي عام للمناعة"
            ],
            question: {
              title: "من فوائد لحم الغنم",
              options: [
                "يقي من الإصابة من الأنيميا",
                "مصدر للبروتينات",
                "كلاهما"
              ],
              answer: "كلاهما"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "تناوله بعتدال لا يسبب اي اضرار بل بالعكس هو من افضل اللحوم الحمراء لكن الاسراف فيه قد يسبب مضر للأشخاص المصابين بمرض النقرس وحصوات الكلي والمصابون بالسمنة والوزن الزائد وكذلك امراض القلب .",
            question: {
              title: "يمكن أن يسبب الإفراط في لحم الغنم أمراض لأصحاب",
              options: ["النقرس", "أمراض القلب", "كلاهما"],
              answer: "كلاهما"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "الاصل في الامور الحل ما لم يأتي نص شرعي بتحريمها او لم تقاس على غيرها."
          }
        }
      }
    ],
    [
      "fish",
      {
        imgName: "../../../assets/img/animal/fish.jpg",
        title: "السمك",
        valueImg: "../../../assets/img/food/fish.jpg",
        information: {
          when: {
            key: "when",
            title: "متى ظهرت",
            answer:
              "لا يعرف بدقة متى انتقلت اللافقاريات إلى فقاريات، لأن هذا الانتقال تم منذ عهد سحيق يتجاوز أربعمائة وخمسين مليون سنة، أي في العصر السلّوري الأدنى، والمعروف أن الأسماك هي الفقاريات الأولى التي ظهرت على سطح الأرض، وكانت جميعها في أول الأمر تنتمي لمجموعة الأسماك المدرعة.",
            question: {
              title: "متي ظهرت الأسماك",
              options: [
                "منذ 450 مليون سنة",
                "منذ 400 مليون سنة",
                "منذ 350 مليون سنة"
              ],
              answer: "منذ 450 مليون سنة"
            }
          },
          where: {
            key: "where",
            title: "أين يتواجد",
            answer:
              "تعيش الأسماك في أي مكان يوجد به الماء، فهي تكثر في المياه الدافئة بجنوبي المحيط الهادئ ومياه المنطقتين القطبية الشمالية والجنوبية حيث المياه المتجمدة، ويعيش بعضها على ارتفاعات عالية في الجداول الجبلية فوق سطح البحر. ويعيش بعضها الآخر تحت سطح البحر في الأعماق السحيقة من المحيط.",
            question: {
              title: "أين تتواجد السمك",
              options: [
                "جنوب المحيط الهاديء",
                "مياه المنطقة الشمالية",
                "كلاهما"
              ],
              answer: "كلاهما"
            }
          },
          benefits: {
            key: "benefits",
            title: "فوائده",
            answer: [
              "تعزيز نمو وعمل الدماغ والخلايا العصبية",
              "تعزيز صحة القلب",
              "الوقاية من التهاب المفاصل",
              "الوقاية من السرطان"
            ],
            question: {
              title: "من فوائد لحم السمك",
              options: ["الحماية من السرطان", "تعزيز صحة القلب", "كلاهما"],
              answer: "كلاهما"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "ينصح بتناول الأسماك الغنية بالزيوت، ولكن عليك بتناول الحد المسموح به فقط من هذه الأسماك، كتناول سرطان البحر وبعض أنواع السمك الأبيض، والذي يعتبر أكثر الأسماك صحية، لإحتواءه على نسبة منخفضة من الدهون، ويعتبر بديلاً للحم الأحمر. كما ينصح بتناول السمك المشوي أو المطهو على البخار، والإبتعاد عن قليه. لأن عملية القلي تزيد من نسبة الدهون في الأسماك والمحار.",
            question: {
              title: "ينصح بشوي السمك وعدم قليه لتجنب",
              options: ["زيادة ضربات القلب", "انخفاض ضغط الدم", "زيادة الدهون"],
              answer: "زيادة الدهون"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "الاصل في الامور الحل ما لم يأتي نص شرعي بتحريمها او لم تقاس على غيرها."
          }
        }
      }
    ],
    [
      "octopus",
      {
        imgName: "../../../assets/img/animal/octopus.jpg",
        title: "الأخطبوط",
        valueImg: "../../../assets/img/food/octopus.jpg",
        information: {
          when: {
            key: "when",
            title: "متى ظهر",
            answer:
              "إن العثور على حفرية لحيوان من رأسيات الأرجل أمر شديد الصعوبة. وعلى الرغم من أن أصداف الأمونيات والأجزاء المدببة من السهميات وغيرها من المؤشرات على أعضاء صلبة من الجسم متوفرة بكثرة في السجل الحفري، نادرًا ما تسنى لعلماء الحفريات رؤية تشريح الأنسجة الرخوة التي تميز هذه الكائنات السبَّاحة متعددة الأذرع. بل إن اكتشاف هذا النوع من الحفريات من الندرة بمكان؛ حتى إن أحدها -حفرية يرجع اكتشافها إلى عام 1982- لا يزال هو الأبرز في هذا المضمار: إنها حفرية أخطبوط يصل عمرها إلى 165 مليون سنة، اكتُشفَت في فرنسا.",
            question: {
              title: "متي ظهر الأخطبوط ",
              options: [
                "قبل 140 مليون سنة",
                "قبل 165 مليون سنة",
                "قبل 170 مليون سنة"
              ],
              answer: "قبل 165 مليون سنة"
            }
          },
          where: {
            key: "where",
            title: "أين يتواجد",
            answer:
              "يوجد الأخطبوط في جميع أنحاء العالم في المياه الضحلة من المناطق الاستوائية وشبه الاستوائية والمعتدلة",
            question: {
              title: "أين يتواجد الأخطبوط",
              options: ["المياه الضحلة", "المياه المتحركة", "كلاهما"],
              answer: "المياه الضحلة"
            }
          },
          benefits: {
            key: "benefits",
            title: "فوائده",
            answer: [
              "الحفاظ علي صحة القلب",
              "تحفيز انتاج الهيموجلبين",
              "تعزيز صحة الدماغ",
              "الحد من الأمراض النفسية"
            ],
            question: {
              title: "من فوائد لحم ",
              options: [
                "الحد من الأمراض النفسية",
                "الحفاظ علي صحة القلب",
                "كلاهما"
              ],
              answer: "كلاهما"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "يتحسَّس بعض الأشخاص المصابين بحساسية الأسماك القشرية من جميع أنواع الأسماك القشرية، يتحسَّس البعض الآخر من أنواع معيَّنة فقط. تتراوح ردود الفعل من الأعراض الخفيفة — مثل الطَفَح الجلدي أو احتقان الأنف — إلى الأعراض الشديدة وحتى المهدِّدة للحياة.",
            question: {
              title: "من أعراض الحساسية للأخطبوط",
              options: ["الطفح الجلدي", "احتقان الأنف", "كلاهما"],
              answer: "كلاهما"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "الاصل في الامور الحل ما لم يأتي نص شرعي بتحريمها او لم تقاس على غيرها."
          }
        }
      }
    ],
    [
      "shrimp",
      {
        imgName: "../../../assets/img/animal/shrimp.jpg",
        title: "الجمبري",
        valueImg: "../../../assets/img/food/shrimp.jpg",
        information: {
          when: {
            key: "when",
            title: "تعرف علي الجمبري",
            answer:
              "الروبيان من أنواع الحيوانات البحرية المشهورة. ثمة أكثر من ألفي نوع متواجد في العالم. يعتبر الروبيان والجمبري من عائلة واحدة، ولكنهما مختلفان في الشكل.",
            question: {
              title: "ما عدد أنواع الجمبري",
              options: ["أكثر من ألفي نوع", "خمسة ألاف نوع", "أقل من ألفي نوع"],
              answer: "أكثر من ألفي نوع"
            }
          },
          where: {
            key: "where",
            title: "أين يتواجد",
            answer:
              "ينتشر الروبيان في أغلب مناطق العالم، ويعيش في المياه سواء كانت مالحة أو عذبة. وتسمى الأنواع الصغيرة منه روبيان بينما تسمى الأصناف الكبيرة منه الجمبري.",
            question: {
              title: "أين يتواجد الجمبري",
              options: ["المياه المالحة", "المياه العذبة", "كلاهما"],
              answer: "كلاهما"
            }
          },
          benefits: {
            key: "benefits",
            title: "فوائده",
            answer: [
              "يعزز جمال البشرة لوجود مضادات الأكسدة",
              "يدعم تكوين الخلايا الحمراء في جسمك، فهو غني بفيتامين A المهم  لتطوير خلايا الدم الحمراء",
              "مقاوم للسرطان",
              "يعتبر مصدراً غنياً بالمعادن، مثل الزنك، والسيلينيوم"
            ],
            question: {
              title: "من فوائد لحم الجمبري",
              options: ["يعزز جمال البشرة", "يقوي عضلات الفخذ", "كلاهما"],
              answer: "يعزز جمال البشرة"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "تشكل نسبة الصوديوم العالية فيه الخطر الأكبر، إذ أن الجمبري يعتبر من المصادر العالية بالصوديوم فكل 6 أوقية منه تحوي ما يقارب 1610 ملغم، ومن المعروف أن الصوديوم المرتفع قد يشكل خطر على مرضى القلب والأوعية الدموية.",
            question: {
              title: "من أعراض الإفراط في تناول الجمبري",
              options: [
                "زيادة نسبة الصوديوم في الجسم",
                "تدهور صحة القلب لمرضي القلب",
                "كلاهما"
              ],
              answer: "كلاهما"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "الاصل في الامور الحل ما لم يأتي نص شرعي بتحريمها او لم تقاس على غيرها."
          }
        }
      }
    ],
    [
      "squid",
      {
        imgName: "../../../assets/img/animal/squid.jpg",
        title: "الحبار",
        valueImg: "../../../assets/img/food/squid.jpg",
        information: {
          when: {
            key: "when",
            title: "تعرف علي الحبار",
            answer:
              "الحبار من الرخويات الصغيرة والمتوسطة الحجم ، والتي يتم العثور عليها في جميع أنحاء مياه المحيطات في العالم . يتشابه الحبار مع الأخطبوط لأنهم من نفس الفصيلة ، إلا ان الحبار لديهم جسم ممدود كبير مع مخالب محيطة لأفواههم",
            question: {
              title: "يشبه الحبار في  شكله",
              options: ["التونة", "الجمبري", "الأخطبوط"],
              answer: "الأخطبوط"
            }
          },
          where: {
            key: "where",
            title: "أين يتواجد",
            answer:
              "يتم العثور الحبار بأعداد كبيرة في جميع أنحاء مياه المحيطات في العالم ، سواء في المناطق الحارة ، أو في المياه الضحلة الاستوائية إلى الأعماق الباردة من أعماق المحيطات .",
            question: {
              title: "أين يتواجد الحبار",
              options: ["المياه الحارة", "المياه الباردة", "كلاهما"],
              answer: "كلاهما"
            }
          },
          benefits: {
            key: "benefits",
            title: "فوائده",
            answer: [
              "الحبار غني بالبوتاسيوم الذي يدعم العضلات ويقي من ضعفها",
              "الحبار عبارة عن بروتين صحي يقوي العضلات",
              "النحاس في الحبار يعزز صحة الدم ويقي من فقر الدم",
              "تناول الحبر يعزز مناعة الجسم"
            ],
            question: {
              title: "من فوائد لحم الحبار",
              options: ["يدعم العضلات", "يقوي الأعصاب", "كلاهما"],
              answer: "كلاهما"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "يجب الانتباه من الإفراط في تناول الحبار، وذلك لأنه يزيد مستوى الكولسترول الضار في الدم، كما يفضل طهيه بطريقة الشوي، والابتعاد عن طبخة بشكل غير صحي، لأن هذه الطريقة تزيد من مخاطره",
            question: {
              title: "من أعراض الإفراط في تناول الحبار",
              options: [
                "ارتفاع ضغط الدم",
                "زيادة نسبة الكولسترول",
                "تدهور صحة القلب"
              ],
              answer: "زيادة نسبة الكولسترول"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "الاصل في الامور الحل ما لم يأتي نص شرعي بتحريمها او لم تقاس على غيرها."
          }
        }
      }
    ],
    [
      "pig",
      {
        imgName: "../../../assets/img/animal/pig.jpg",
        title: "الخنزير",
        information: {
          when: {
            key: "when",
            title: "متى نشأ",
            answer:
              "ومنشأه العالم القديم في قارات آسيا وأفريقيا لا سيما في المناطق الموحلة ومناطق السافانا، كما يتواجد أحد أنواع الخنازير في أوروبا",
            question: {
              title: "متي ظهر الخنزير",
              options: ["من آلاف السنين", "من عشرات السنين", "من بضع سنين"],
              answer: "من آلاف السنين"
            }
          },
          where: {
            key: "where",
            title: "منشأه",
            answer:
              "ومنشأه العالم القديم في قارات آسيا وأفريقيا لا سيما في المناطق الموحلة ومناطق السافانا، كما يتواجد أحد أنواع الخنازير في أوروبا",
            question: {
              title: "أين يتواجد الخنزير",
              options: ["آسيا", "افريقيا", "كلاهما"],
              answer: "كلاهما"
            }
          },
          benefits: {
            key: "benefits",
            title: "أضراره",
            answer: [
              "مرض دودة الخنزير وشريطية وحيدة",
              "داء البروسيلات",
              "داء الكيسات المذنبة"
            ],
            question: {
              title: "من أضرار تناول لحم الخنزير الإصابة",
              options: ["دودة الخنزير", "داء البروسيلات", "كلاهما"],
              answer: "كلاهما"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "يمكن أن يصاب الشخص المدمن على تناول لحم الخنزير بالتهاب الكبد E، وهو مرض فيروسي يصيب الكبد، ورغم أن هذا المرض لا يشكل خطرا على حياة الإنسان، ومن الممكن علاجه، إلا أنه خطر جدا على النساء الحوامل، حيث تشير البيانات الرسمية إلى أن 25% من النساء الحوامل المصابات بهذا المرض يمتن في الأسابيع الأخيرة من فترة الحمل.",
            question: {
              title: "من أعراض الإفراط في تناول لحم الخنزير",
              options: ["التأثير علي الحوامل", "التهاب الكبد", "كلاهما"],
              answer: "كلاهما"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "الخنزير كله نجس مُحرَّم بجميع أجزائه، وقد استدل العلماء على حكم تحريم أكل لحم الخنزير من القرآن الكريم والسنة النبوية، فمن كتاب الله تعالى قوله تعالى: (حُرِّمَتْ عَلَيْكُمُ الْمَيْتَةُ وَالدَّمُ وَلَحْمُ الْخِنزِيرِ)"
          }
        }
      }
    ],
    [
      "donkey",
      {
        imgName: "../../../assets/img/animal/donkey.jpg",
        title: "الحمار",
        information: {
          when: {
            key: "when",
            title: "بداية ظهور الحمار",
            answer:
              "وجد الحمار لأول مرة في القرن الأفريقي قبل ما يقارب 12 ألف سنة. جد الحمار الحالي المعروف، هو الحمار النوبي، الصومالي، حسب كتاب كلوتون بروك، التاريخ الطبيعي للحيوانات الأليفة، 1999، دجن خلالها الحمار الأفريقي من حوالي 4000 سنة قم",
            question: {
              title: "متي ظهر الحمار",
              options: ["قبل 12 ألف سنة", "قبل 11 ألف سنة", "قبل 13 ألف سنة"],
              answer: "قبل 12 ألف سنة"
            }
          },
          where: {
            key: "where",
            title: "أين يتواجد",
            answer:
              "هو حيوان أليف، ويوجد نوع يعيش بصورة برية في وديان و صحاري أفريقيا وآسيا وبراريها ويسمى بالحمار الوحشي",
            question: {
              title: "أين يتواجد الحمار الوحشي",
              options: ["صحاري أفريقيا", "آسيا", "كلاهما"],
              answer: "كلاهما"
            }
          },
          benefits: {
            key: "benefits",
            title: "أضراره",
            answer: [
              "التسمم الغذائيّ والكيميائيّ",
              "الإسهال والقيء",
              "أمراض الكبد والكلي"
            ],
            question: {
              title: "من أضرار لحم الحمار",
              options: ["الإسهال", "القيء", "كلاهما"],
              answer: "كلاهما"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "لُعاب لزج ومائل للحُمرة أسفل اللسان، وبالإمكان الكشف عنهُ من خلال النظر إلى المرآة، فذلِكَ يعني استهلاك كميّاتٍ كبيرة من لحم الحمير. كذلك ظهور حبوب صغيرة ومُدببة الرأس خلف الأذن وإمكانيّة تحسسها باستخدام أطراف الأصابع، بسبب استهلاك الشخص لكفتة أو رِيَش لحم الحمير غير الطازج",
            question: {
              title: "من أعراض تناول لحم الحمير",
              options: [
                "ظهور حبوب صغيرة خلف الأذن",
                "تورم اليدين",
                "الإصابة بالوخم"
              ],
              answer: "ظهور حبوب صغيرة خلف الأذن"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "يُعتبر لحم الحمير مُحرّماً للحديث النبوي الذّي ينهى عن تناوله، فعن جابر رضي الله عنه قال: نهى رسول الله صلى الله عليه وسلم يوم خيبر عن لحوم الحُمر الأهليّة، وأذن في لحوم الخيل."
          }
        }
      }
    ],
    [
      "lion",
      {
        imgName: "../../../assets/img/animal/lion.jpg",
        title: "الأسد",
        information: {
          when: {
            key: "when",
            title: "منشأ الأسود",
            answer:
              "كان موطن الأسود شاسعًا جدًا في السابق، حيث كانت تتواجد في شمال إفريقيا، الشرق الأوسط، وآسيا الغربية، حيث انقرضت منذ بضعة قرون فقط. وحتى بداية العصر الحديث (الهولوسين، منذ حوالي 10,000 سنة)، كانت الأسود تُعتبر أكثر ثدييات اليابسة الكبرى انتشارا بعد الإنسان، حيث كانت توجد في معظم أنحاء إفريقيا، الكثير من أنحاء أوراسيا من أوروبا الغربية وصولا إلى الهند، وفي الأمريكيتين، من يوكون حتى البيرو.",
            question: {
              title: "تعيش الأسود منذ",
              options: ["8000 سنة", "9000 سنة", "10000 سنة"],
              answer: "10000 سنة"
            }
          },
          where: {
            key: "where",
            title: "أين يتواجد",
            answer:
              " تعيش معظم الأسود البرية المتبقية اليوم في إفريقيا جنوب الصحراء الكبرى، ولا تزال جمهرة واحدة صغيرة مهددة بالانقراض تعيش في آسيا بولاية غوجرات في شمال غربي الهند.",
            question: {
              title: "أين يتواجد الأسد",
              options: ["شمال افريقيا", "شمال آسيا", "شمال أوروبا"],
              answer: "شمال افريقيا"
            }
          },
          benefits: {
            key: "benefits",
            title: "أضراره",
            answer: [
              "تصاب بنوع من الشراسة والميل إلى العنف",
              "الرغبة في سفك الدماء",
              "نوع من الفوضى وانعدام الغيرة على الجنس الآخر فضلاً عن عدم احترام نظام الأسرة"
            ],
            question: {
              title: "من أضرار لحم ",
              options: [
                "لا يثبت له أضرار صحية",
                "له أضرار اجتماعية",
                "يزيد من ضغط الدم"
              ],
              answer: "له أضرار اجتماعية"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "لوحظ على الشعوب آكلات لحوم الجوارح أو غيرها من اللحوم التي حرم الإسلام أكلها أنها تصاب بنوع من الشراسة والميل إلى العنف ولو بدون سبب إلا الرغبة في سفك الدماء، ولقد أكدت الدراسات والبحوث هذه الظاهرة على القبائل المتخلفة التي تستمرئ أكل مثل تلك اللحوم إلى حد أن بعضها يصاب بالضراوة فيأكل لحوم البشر، كما انتهت تلك الدراسات أيضاً إلى ظاهرة أخرى في هذه القبائل، وهي إصابتها بنوع من الفوضى وانعدام الغيرة على الجنس الآخر فضلاً عن عدم احترام نظام الأسرة، وهي حالة أقرب إلى حياة تلك الحيوانات المفترسة.",
            question: {
              title: "من أعراض تناول لحم الأسد",
              options: ["الإصابة بنوع من الشراسة", "الإسهال", "الإمساك"],
              answer: "الإصابة بنوع من الشراسة"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "فأكل لحم الجوارح حرام شرعا لما جاء في النصوص النبوية، عن النبي عليه الصلاة والسلام أنه قال: «أكل كل ذي ناب من السباع حرام»، وعن ابن عباس قال: «نهى رسول الله صلى الله عليه وسلم عن أكل كل ذي ناب من السباع وكل ذي مخلب من الطير»"
          }
        }
      }
    ],
    [
      "dog",
      {
        imgName: "../../../assets/img/animal/dog.jpg",
        title: "الكلب",
        information: {
          when: {
            key: "when",
            title: "علاقة الكلب بالإنسان",
            answer:
              "دجن هذا الحيوان واستأنس قبل 14000 إلى 150000 سنة. عادة ما يتم وصف هذا الحيوان بالوفاء، ويطلق عليه لقب أفضل صديق للإنسان ذلك لمقدرته العالية على تذكر صاحبه ولو بعد انقطاع طويل عنه.",
            question: {
              title: "متي استأنس الكلب",
              options: [
                "منذ عشرات السنين",
                "منذ آلاف السنين",
                "منذ سنوات قليلة"
              ],
              answer: "منذ آلاف السنين"
            }
          },
          where: {
            key: "where",
            title: "أين يتواجد",
            answer:
              "تتضمن فصيلة الكلاب عدة أنواع أبرزها الثعالب والذئاب إضافةً إلى آبن آوي، وفيما يتعلق بالكلب يعتبر أوّل الثدييات التي استطاع الإنسان ترويضها، وكان ذلك قبل حوالي ستين مليون سنة، في قارّتي آسيا وأوروبا إضافةً إلى شمالي القارّة الأمريكيّة، بحيث كانت تتجوّل في بحثاً عن غذاء لها.",
            question: {
              title: "أين تواجدت الكلاب",
              options: ["آسيا", "أوروبا", "كلاهما"],
              answer: "كلاهما"
            }
          },
          benefits: {
            key: "benefits",
            title: "أضراره",
            answer: [
              "الإصابة بداء الكلب",
              "داء البروسيلات",
              "التهاب الكبد",
              "داء البريميات"
            ],
            question: {
              title: "من أضرار أكل لحم الكلب",
              options: ["التهاب الكبد", "الإصابة بالسرطان", "آلام في المعدة"],
              answer: "التهاب الكبد"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "الأمر الأخطر من هذه الأمراض هو انتشار البكتيريا المرتبطة بالكوليرا والتى تنتشر بسهولة من خلال عملية النقل الجماعي للكلاب المذبوحة للاستهلاك، فقد حذر مارك مارك أوليف ممثل منظمة الصحة العالمية، من أن تناول لحوم الكلاب يرتبط بزيادة 20 ضعفًا في خطر الإصابة بالبكتيريا المرتبطة بالكوليرا وذلك بشكل خاص بعد انتشارها فى فيتنام نتيجة لهذا الأمر.",
            question: {
              title: "من أعراض أكل لحم الكلب الإصابة بمرض",
              options: ["الكوليرا ", "مرض الكلب", "كلاهما"],
              answer: "كلاهما"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "فأكل لحم الجوارح حرام شرعا لما جاء في النصوص النبوية، عن النبي عليه الصلاة والسلام أنه قال: «أكل كل ذي ناب من السباع حرام»، وعن ابن عباس قال: «نهى رسول الله صلى الله عليه وسلم عن أكل كل ذي ناب من السباع وكل ذي مخلب من الطير»"
          }
        }
      }
    ],
    [
      "falcon",
      {
        imgName: "../../../assets/img/animal/falcon.jpg",
        title: "الصقر",
        information: {
          when: {
            key: "when",
            title: "علاقة الصقر بالإنسان",
            answer:
              "إن العلاقة بين الصقور والإنسان تعود إلى آلاف السنين حيث وجدت صور نحتت على الصخور منذ العصر الحجري وقد أعجب الإنسان من قبل 2000 سنة قبل الميلاد بتربية الصقور وتكاثرها ورعايتها وعلى الرغم من أن التقارير محدودة حول استخدام الصقور في الصيد في تلك الحقبة وما زالت الصقور تستخدم ليومنا هذا لنفس السبب الذي كانت تستخدم به سابقاً كهواية بالصيد بل إن الإنسان قد طور هذه الهواية لتصبح رياضة يستمتع بها الجميع.",
            question: {
              title: "متي بدأت علاقة الإنسان بالصقور",
              options: [
                "قبل 3000 سنة قبل الميلاد",
                "قبل 3500 سنة قبل الميلاد",
                "قبل 2000 سنة قبل الميلاد"
              ],
              answer: "قبل 2000 سنة قبل الميلاد"
            }
          },
          where: {
            key: "where",
            title: "أين يتواجد",
            answer:
              "تعيش الصقور في جميع مناطق العالم باستثناء القارة القطبيّة الجنوبيّة، ولكن هناك بعض الأنواع التي تفضِّل العيش في الأماكن المعتدلة في النصف الشمالي من الكرة الأرضية.",
            question: {
              title: "أين يتواجد الصقر",
              options: ["السعودية", "الإمارات", "كلاهما"],
              answer: "كلاهما"
            }
          },
          benefits: {
            key: "benefits",
            title: "أضراره",
            answer: ["البكتريا الضارة", "يمكن أن يسبب التسمم"],
            question: {
              title: "من أضرار تناول لحم الصقور",
              options: [
                "الإصابة بالبكتريا الضارة",
                "الهبوط الحاد",
                "الشعور بالدوار"
              ],
              answer: "الإصابة بالبكتريا الضارة"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "لا يعرف آثار لأكل لحوم الصقر نظرا لعدم اعتماد الإنسان في الطعام أو تجربتها ولكن هي من طيور الجوارح التي تعتمد علي الحيوانات الأخري، فإذا تعرض الإنسان للحمها يمكن أن يصاب بالبكتريا أو الفيروسات، كذلك قد يصاب بتسمم أو ما شابه.",
            question: {
              title: "من أعراض تناول لحم الصقر",
              options: [
                "هبوط في الدورة الدموية",
                "الإصابة بالدوار",
                "غير معلوم"
              ],
              answer: "غير معلوم"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "فأكل لحم الجوارح حرام شرعا لما جاء في النصوص النبوية، عن النبي عليه الصلاة والسلام أنه قال: «أكل كل ذي ناب من السباع حرام»، وعن ابن عباس قال: «نهى رسول الله صلى الله عليه وسلم عن أكل كل ذي ناب من السباع وكل ذي مخلب من الطير»"
          }
        }
      }
    ],
    [
      "eagle",
      {
        imgName: "../../../assets/img/animal/eagle.jpg",
        title: "العقاب",
        information: {
          when: {
            key: "when",
            title: "تعرف علي العقاب",
            answer:
              "العِقْبان طيور جارحة ضخمة وقوية البنية، ولها رؤوس ومناقير كبيرة، وحتى أصغر العقبان حجمًا لها أجنحة طويلة وعريضة وتستطيع الطيران بسرعة كبيرة. وكباقي الطيور الجارحة، فإن للعقبان مناقير معقوفة ضخمة تستخدمها لتمزيق اللحم عن فريستها",
            question: {
              title: "يتميز العقاب ب",
              options: ["قوة البنية", "طول أجنحته", "كلاهما"],
              answer: "كلاهما"
            }
          },
          where: {
            key: "where",
            title: "أين يتواجد",
            answer:
              "له أكثر من واحد وستين نوعا يعيش معظمها في أوراسيا وأفريقيا، ويوجد خارج هذه المنطقة نوعان يعيشان في الولايات المتحدة وكندا هما العقاب الأصلع والعقاب الذهبي، وتسعة أنواع في أواسط أمريكا وجنوبها، وثلاثة أنواع في أستراليا، وهناك أنواع عدة من العقبان توجد في الفلبين.",
            question: {
              title: "أين يتواجد العقاب بكثرة",
              options: ["أوراسيا", "كنذا", "الفلبين"],
              answer: "أوراسيا"
            }
          },
          benefits: {
            key: "benefits",
            title: "أضراره",
            answer: ["البكتريا الضارة", "يمكن أن يسبب التسمم"],
            question: {
              title: "من أضرار تناول لحم العقاب",
              options: [
                "الإصابة بالبكتريا الضارة",
                "الهبوط الحاد",
                "الشعور بالدوار"
              ],
              answer: "الإصابة بالبكتريا الضارة"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "لا يعرف آثار لأكل لحوم الصقر نظرا لعدم اعتماد الإنسان في الطعام أو تجربتها ولكن هي من طيور الجوارح التي تعتمد علي الحيوانات الأخري، فإذا تعرض الإنسان للحمها يمكن أن يصاب بالبكتريا أو الفيروسات، كذلك قد يصاب بتسمم أو ما شابه.",
            question: {
              title: "من أعراض تناول لحم العقاب",
              options: [
                "هبوط في الدورة الدموية",
                "الإصابة بالدوار",
                "غير معلوم"
              ],
              answer: "غير معلوم"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "فأكل لحم الجوارح حرام شرعا لما جاء في النصوص النبوية، عن النبي عليه الصلاة والسلام أنه قال: «أكل كل ذي ناب من السباع حرام»، وعن ابن عباس قال: «نهى رسول الله صلى الله عليه وسلم عن أكل كل ذي ناب من السباع وكل ذي مخلب من الطير»"
          }
        }
      }
    ],
    [
      "owl",
      {
        imgName: "../../../assets/img/animal/owl.jpg",
        title: "البومة",
        information: {
          when: {
            key: "when",
            title: "تعرف علي البومة",
            answer:
              "طائرٌ جارحٌ يَنشَطُ بصورةٍ رئيسيةٍ ليلاً. وهو يستعينُ بحاسةِ سمعِهِ القويّةِ وعينيهِ الكبيرتينِ اللتينِ توفرانِ رؤيةً ليليةً جيدةً، في اصطيادِ الفئرانِ والأرانبِ وغيرها من الحيوانات الصغيرة. للبوم ريشٌ ناعمٌ يوفر له طيرانا صامتا حتى لا يكشف أمره. ولبعضِ أنواعِهِ نَعيقٌ يَسهُلُ تمييزُهُ.",
            question: {
              title: "تتميز البومة ب",
              options: ["السمع القوي", "الريش الناعم", "كلاهما"],
              answer: "كلاهما"
            }
          },
          where: {
            key: "where",
            title: "أين يتواجد",
            answer:
              "يعيشُ بوم الجحور ومَوْطِنُهُ أميركا الشمالية وأميركا الجنوبية في جُحورٍ أرضيةٍ. وهو يحفرُ الجُحرَ بنفسهِ أو يستعيرُ جُحراً هجرهُ حيوانٌ آخرُ، مثلُ السُّلحفاةِ الأميركيّةِ.",
            question: {
              title: "أين يتواجد بوم الجحور",
              options: [
                "دول أمريكا الشمالية",
                "دول الشرق الأوسط",
                "دول الخليج"
              ],
              answer: "دول أمريكا الشمالية"
            }
          },
          benefits: {
            key: "benefits",
            title: "أضراره",
            answer: ["البكتريا الضارة", "يمكن أن يسبب التسمم"],
            question: {
              title: "من أضرار تناول لحم البوم",
              options: ["الإصابة بالبكتريا الضارة", "التسمم", "كلاهما"],
              answer: "كلاهما"
            }
          },
          sensitivity: {
            key: "sensitivity",
            title: "الحساسية",
            answer:
              "يعتمد أكل البوم بشكل أساسي علي الحيوانات الصغيرة وخاصة الفئران، مما يعرض الإنسان للإصابة بالكثير من الأمراض كفيروسات هنتا وغيرها.",
            question: {
              title: "من أعراض تناول لحم البوم",
              options: [
                "الإصابة بنزلة معوية",
                "الإصابة بفيروس هنتا",
                "انخفاض في درجة الحرارة"
              ],
              answer: "الإصابة بفيروس هنتا"
            }
          },
          ruling: {
            title: "الحكم الشرعى",
            answer:
              "فأكل لحم الجوارح حرام شرعا لما جاء في النصوص النبوية، عن النبي عليه الصلاة والسلام أنه قال: «أكل كل ذي ناب من السباع حرام»، وعن ابن عباس قال: «نهى رسول الله صلى الله عليه وسلم عن أكل كل ذي ناب من السباع وكل ذي مخلب من الطير»"
          }
        }
      }
    ]
  ];

  myFoods = new Map(this.foods);
  questionBgImg: string = "../../../assets/img/food/question.jpg";
  myFood: any = {};
  id: string;
  selectedValue: string = "";

  @ViewChild("whenDiv", { static: true }) whenDiv: ElementRef;
  @ViewChild("whereDiv", { static: true }) whereDiv: ElementRef;
  @ViewChild("benefitDiv", { static: true }) benefitDiv: ElementRef;
  @ViewChild("senseDiv", { static: true }) SenseDiv: ElementRef;

  correctAnswer = `<div class="alert alert-success wow pulse text-center font-weight-bold" data-wow-duration="1.5s">إجابة صحيحة</div>`;
  incorrectAnswer = `<div class="alert alert-danger wow shake text-center font-weight-bold">إجابة خاطئة</div>`;

  constructor(private route: ActivatedRoute) {
    this.id = this.route.snapshot.params.id;
  }

  ngOnInit() {
    this.myFoods.forEach((value, key) => {
      if (key == this.id) {
        this.myFood = value;
        //console.log(this.myFood);
      }
    });
  }

  getSelectedValue(value: string) {
    this.selectedValue = value;
  }

  check(answer: string, key: string) {
    if (key == "when") {
      if (this.selectedValue == answer) {
        $(this.whenDiv.nativeElement).html(this.correctAnswer);
      } else {
        $(this.whenDiv.nativeElement).html(this.incorrectAnswer);
      }
    } else if (key == "where") {
      if (this.selectedValue == answer) {
        $(this.whereDiv.nativeElement).html(this.correctAnswer);
      } else {
        $(this.whereDiv.nativeElement).html(this.incorrectAnswer);
      }
    } else if (key == "benefits") {
      if (this.selectedValue == answer) {
        $(this.benefitDiv.nativeElement).html(this.correctAnswer);
      } else {
        $(this.benefitDiv.nativeElement).html(this.incorrectAnswer);
      }
    } else if (key == "sensitivity") {
      if (this.selectedValue == answer) {
        $(this.SenseDiv.nativeElement).html(this.correctAnswer);
      } else {
        $(this.SenseDiv.nativeElement).html(this.incorrectAnswer);
      }
    }
  }
}
